jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
/**
 * @file lpc2478_hardware_abstractions.c
 *
 * Hardware abstraction layer for the lpc2478-stk board
 *
 * @author German Rivera 
 */ 

#include "hardware_abstractions.h"
#include "lpc2478_stk_board.h"
#include "failure_data_capture.h"
#include "utils.h"
#include "McRTOS_config_parameters.h"
#include "McRTOS_kernel_services.h"

TODO("Remove these pragmas")
#pragma GCC diagnostic ignored "-Wunused-variable"

/*
 * Number of times the timer counter register (reg_TC) is incremented before
 * the timer generates an interrupt
 * Since we want MR0 to be the smallest non-zero value (1) and the value for MR0 is
 * given by TARGET_NUM_TC_INCREMENTS - 1, TARGET_NUM_TC_INCREMENTS must be 2.
 */
#define TARGET_NUM_TC_INCREMENTS    UINT32_C(2)

/**
 * CPU clock frequency in Hz
 */
#define CPU_CLOCK_FREQ_IN_HZ \
        (SOC_CPU_CLOCK_FREQ_IN_MEGA_HZ * UINT32_C(1000000))

/**
 * CPU clock cycle counter timer frequency in Hz
 * (CPU clock frequency divided by CPU_CLOCK_FREQ_DIVIDER)
 */
#define CPU_CLOCK_CYCLE_COUNTER_TIMER_FREQUENCY \
        (CPU_CLOCK_FREQ_IN_HZ / CPU_CLOCK_FREQ_DIVIDER)

#define CPU_CLOCK_FREQ_DIVIDER  1

/**
 * A/D converter clock frequency in Hz
 */
#define ADC_CLOCK_FREQUENCY (UINT32_C(2) * 1000 * 1000)   /* 2 MHz */

C_ASSERT(ADC_CLOCK_FREQUENCY <= MAX_ADC_CLOCK_FREQUENCY);

/**
 * SSP clock frequency in Hz
 */
#define SSP_CLOCK_FREQUENCY (UINT32_C(2) * 1000 * 1000)   /* 2 MHz */

C_ASSERT(SSP_CLOCK_FREQUENCY <= MAX_SSP_CLOCK_FREQUENCY);

/**
 * Macro to generate dummy VIC ISR functions
 */
#define GENERATE_DUMMY_VIC_ISR_FUNCTION(_peripheral_name,                   \
                                        _vic_interrupt_channel)             \
        __attribute__((interrupt ("IRQ")))                                  \
        void                                                                \
        dummy_ ## _peripheral_name ## _isr(void)                            \
        {                                                                   \
            /* This function should not have been invoked */                \
            FDC_ASSERT(false, _vic_interrupt_channel, 0);                   \
            FDC_ASSERT_INTERRUPT_SOURCE_IS_SET(_vic_interrupt_channel);     \
                                                                            \
            /* Tell VIC that interrupt has been serviced */                 \
            g_vic_mmio_registers_p->reg_VICAddress = 0x0;                   \
        }

/**
 * Serial communication parameters for the serial port used as the console
 * port
 */
#define DEBUG_SERIAL_PORT_BAUD_RATE   38400
#define DEBUG_SERIAL_PORT_MODE        UART_8N1

struct scbParams {
    uint16_t PLL_M_Mul; /* PLL Multiplier. Valid values 6 through 512*/
    uint8_t  PLL_N_Div; /* PLL Divider. Valid values 1 through 32 */
    uint32_t PLL_Fcco;  /* Frequency (Hz) of PLL output */
    uint8_t  CCLK_Div;  /* CPU Clock divider, cclk */
    uint8_t  MAMMode;   /* */
    uint8_t  MAMTim;
};

struct timer_device {
#   define TIMER_DEVICE_SIGNATURE  GEN_SIGNATURE('T', 'I', 'M', 'R')
    uint32_t tmr_signature;
    lpc2478_timer_t *tmr_mmio_registers_p;
    uint32_t tmr_timer_pclk_shift;
    uint32_t tmr_pclksel_index;
    uint32_t tmr_pconp_mask;
    struct rtos_interrupt_registration_params tmr_rtos_interrupt_params;
    struct rtos_interrupt **tmr_rtos_interrupt_pp;
};

/**
 * Const fields of a UART device (to be placed in flash)
 */
struct uart_device {
#   define UART_DEVICE_SIGNATURE  GEN_SIGNATURE('U', 'A', 'R', 'T')
    uint32_t urt_signature;
    struct uart_device_var *urt_var_p;
    lpc2478_uart_t *urt_mmio_uart_p;
    uint32_t urt_uart_pclk;
    uint32_t urt_pclksel_index;
    uint32_t urt_pconp_mask;
    struct rtos_interrupt_registration_params urt_rtos_interrupt_params;
    struct rtos_interrupt **urt_rtos_interrupt_pp;
    const char *urt_thre_condvar_name_p;
    const char *urt_rdr_condvar_name_p;
};

/**
 * Non-const fields of a UART device (to be placed in SRAM)
 */
struct uart_device_var {
    bool urt_initialized;
    bool urt_signal_thre_condvar;
    bool urt_signal_rdr_condvar;
    volatile bool urt_byte_received_pending;
    uint8_t urt_first_byte_received;
    struct rtos_condvar urt_thre_condvar;
    struct rtos_condvar urt_rdr_condvar;
};

/**
 * Const fields of the buttons device (to be placed in flash)
 */
struct buttons_device {
#   define BUTTONS_DEVICE_SIGNATURE  GEN_SIGNATURE('B', 'U', 'T', 'T')
    uint32_t bd_signature;
    struct buttons_device_var *bd_var_p;
    uint8_t bd_gpio_port_index;
    volatile struct gpio_interrupt_registers *bd_gpio_mmio_interrupt_registers_p;
    volatile struct gpio_port_interrupt_registers *bd_gpio_port_mmio_interrupt_registers_p;
    struct pin_config_info bd_button1_pin;
    struct pin_config_info bd_button2_pin;
    struct rtos_interrupt_registration_params bd_rtos_interrupt_params;
    struct rtos_interrupt **bd_rtos_interrupt_pp;
    const char *bd_condvar_name_p;
};

/**
 * Non-const fields of the buttons device (to be placed in SRAM)
 */
struct buttons_device_var {
    volatile uint32_t bd_buttons_pressed_bitmap;
    struct rtos_condvar bd_condvar;
};

/**
 * Const fields of the A/D converter device (to be placed in flash)
 */
struct adc_device {
#   define ADC_DEVICE_SIGNATURE  GEN_SIGNATURE('A', '/', 'D', 'C')
    uint32_t ad_signature;
    lpc2478_adc_t *ad_mmio_registers_p;
    struct rtos_interrupt_registration_params ad_rtos_interrupt_params;
    struct rtos_interrupt **ad_rtos_interrupt_pp;
    const char *ad_channel_condvar_names[NUM_ADC_CHANNELS];
    struct adc_channel *ad_adc_channels_p;
};

/**
 * Non-const fields of an A/D converter channel (to be placed in SRAM)
 */
struct adc_channel {
    /**
     * Condvar to signal a thread waiting for an A/D conversion
     */
    struct rtos_condvar adc_condvar;
    
    /**
     * Last value read from the V/VREF field of the corresponding ADC channel's
     * reg_AD0DR[] register, by the A/D conversion completion interrupt handler.
     */
    volatile uint16_t adc_result;

    /**
     * Boolean flag that indicates if an outstanding A/D conversion has completed
     */
    volatile uint8_t adc_conversion_completed;

    uint8_t  adc_reserved;
};

/**
 * Const fields of an SSP controller (to be placed in flash)
 */
struct ssp_controller {
#   define   SSP_CONTROLLER_SIGNATURE  GEN_SIGNATURE('S', 'S', 'P', 'C')
    uint32_t sc_signature;
    struct ssp_controller_var *sc_var_p;
    lpc2478_ssp_t *sc_mmio_registers_p;
    vic_interrupt_channel_t sc_vic_channel;
    uint32_t sc_ssp_pclk_shift;
    uint32_t sc_pclksel_index;
    uint32_t sc_pconp_mask;
    struct pin_config_info sc_pin_sck;
    struct pin_config_info sc_pin_ssel;
    struct pin_config_info sc_pin_miso;
    struct pin_config_info sc_pin_mosi;
    struct rtos_interrupt_registration_params sc_rtos_interrupt_params;
    struct rtos_interrupt **sc_rtos_interrupt_pp;
    const char *sc_condvar_name_p;
};

/**
 * Non-const fields of an SSP controller (to be placed in SRAM)
 */
struct ssp_controller_var
{
    struct rtos_condvar sc_condvar;
    volatile bool sc_interrupt_pending;
};


/* local functions */
static uint32_t getFcclk(void);

static void initPLL(const struct scbParams *pSCBParams);
static void initPCLK(void);
static void initGPIO(void);
static void initMAM(uint32_t cclk, uint8_t mamcr, uint8_t mamtim_override);
static void initVIC(void);
static void initSDRAM(uint32_t cclk);
static void disableSDRAM(void);

static void init_uart_internal(
    const struct uart_device *uart_device_p,
    uint32_t baud,
    uint8_t mode,
    uint8_t fmode,
    uint32_t cclk);

