jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
static void init_timer(
    const struct timer_device *timer_device_p,
    uint32_t timer_frequency_hz,
    bool generate_interrupts);

static void
init_leds(void);

static void
init_adc(const struct adc_device *adc_device_p);

#if 0
static void
init_spi(bool master);
#endif


/* 
 * Added function prototypes for dummy VIC interrupt ISRs
 */
static isr_function_t dummy_wdt_isr;
static isr_function_t dummy_softint_isr;
static isr_function_t dummy_armcore0_isr;
static isr_function_t dummy_armcore1_isr;
static isr_function_t dummy_timer0_isr;
static isr_function_t dummy_timer1_isr;
static isr_function_t dummy_uart0_isr;
static isr_function_t dummy_uart1_isr;
static isr_function_t dummy_pwm0_1_isr;
static isr_function_t dummy_i2c0_isr;
static isr_function_t dummy_spi_ssp0_isr;
static isr_function_t dummy_ssp1_isr;
static isr_function_t dummy_pll_isr;
static isr_function_t dummy_rtc_isr;
static isr_function_t dummy_eint0_isr;
static isr_function_t dummy_eint1_isr;
static isr_function_t dummy_eint2_isr;
static isr_function_t dummy_eint3_isr;
static isr_function_t dummy_ad0_isr;
static isr_function_t dummy_i2c1_isr;
static isr_function_t dummy_bod_isr;
static isr_function_t dummy_ethernet_isr;
static isr_function_t dummy_usb_isr;
static isr_function_t dummy_can_isr;
static isr_function_t dummy_sd_mmc_isr;
static isr_function_t dummy_gpdma_isr;
static isr_function_t dummy_timer2_isr;
static isr_function_t dummy_timer3_isr;
static isr_function_t dummy_uart2_isr;
static isr_function_t dummy_uart3_isr;
static isr_function_t dummy_i2c2_isr;
static isr_function_t dummy_i2s_isr;

/*
 * ISR assembly routines defined in lpc2478_interrupt_handlers.s
 */
extern isr_function_t isr_timer0;
extern isr_function_t isr_gpio_ports;
extern isr_function_t isr_uart0;
extern isr_function_t isr_ssp_controller0;
extern isr_function_t isr_ssp_controller1;
extern isr_function_t isr_adc;

/**
 * Global pointer to the SDRAM map
 */ 
struct sdram_map *const g_sdram_map_p = (struct sdram_map *)BOARD_SDRAM_BASE;

/**
 * Global pointer to the beginning of unused SDRAM
 */ 
void *const g_available_sdram_p = (void *)AVAILABLE_SDRAM_START_ADDR;

/*
 * Added definition of global pointers that point to memory-mapped
 * I/O registers
 */

/**
 * Global definition of const pointer to the array of fast_gpio_port structs,
 * one entry per fast GPIO port of the LPC2478.
 */ 
static volatile struct fast_gpio_port *const g_fast_gpio_ports_array =
    (struct fast_gpio_port *)FIO_BASE_ADDR;

/**
 * Global definition of const pointer to the memory-mapped registers of the
 * LPC2478 Pin Connect Block
 */
pin_connect_block_t *const g_pin_connect_block = (pin_connect_block_t *)PINCON_BASE_ADDR;

/**
 * Global definition of const pointer to the memory-mapped registers of the
 * LPC2478 SCB (System Control Block)
 */
lpc2478_scb_t *const g_scb_mmio_registers_p = (lpc2478_scb_t *)LPC2478_SCB_BASE_ADDR;

/**
 * Global definition of const pointer to the memory-mapped registers of the
 * LPC2478 EMC (External Memory Controller)
 */
lpc2478_emc_t *const g_emc_mmio_registers_p = (lpc2478_emc_t *)LPC2478_EMC_BASE_ADDR;

/**
 * Global definition of const pointer to the memory-mapped registers of the
 * LPC2478 VIC (Vectored Interrupt Controller)
 */
static lpc2478_vic_t *const g_vic_mmio_registers_p = (lpc2478_vic_t *)LPC2478_VIC_BASE_ADDR;

/**
 * Pointer to the McRTOS interrupt object for the tick timer interrupt of CPU
 * core 0
 *
 * NOTE: This variable is accessed from lpc2478_interrupt_handlers.s
 */
struct rtos_interrupt *g_rtos_interrupt_timer0 = NULL;

/**
 * Global array of const structures for timer devices for the LPC2478 
 * (allocated in flash space)
 */
static const struct timer_device g_timer_devices[] =
{
    [0] = {
        .tmr_signature = TIMER_DEVICE_SIGNATURE,
        .tmr_mmio_registers_p = (lpc2478_timer_t *)LPC2478_TIMER0_BASE_ADDR,
        .tmr_timer_pclk_shift = PCLK_TIMER0,
        .tmr_pclksel_index = 0,
        .tmr_pconp_mask = PCONP_PCTIM0,
        .tmr_rtos_interrupt_params = {
            .irp_name_p = "McRTOS Tick Timer Interrupt",
            .irp_isr_function_p = isr_timer0,
            .irp_arg_p =  (void *)&g_timer_devices[0],
            .irp_channel = VIC_CHANNEL_TIMER0,
            .irp_priority = VIC_VECT_PRIORITY2,
            .irp_cpu_id = 0,
        },
        .tmr_rtos_interrupt_pp = &g_rtos_interrupt_timer0,
    },
    [1] = {
        .tmr_signature = TIMER_DEVICE_SIGNATURE,
        .tmr_mmio_registers_p = (lpc2478_timer_t *)LPC2478_TIMER1_BASE_ADDR,
        .tmr_timer_pclk_shift = PCLK_TIMER1,
        .tmr_pclksel_index = 0,
        .tmr_pconp_mask = PCONP_PCTIM1,
    },
    [2] = {
        .tmr_signature = TIMER_DEVICE_SIGNATURE,
        .tmr_mmio_registers_p = (lpc2478_timer_t *)LPC2478_TIMER2_BASE_ADDR,
        .tmr_timer_pclk_shift = PCLK_TIMER2,
        .tmr_pclksel_index = 1,
        .tmr_pconp_mask = PCONP_PCTIM2,
    },
    [3] = {
        .tmr_signature = TIMER_DEVICE_SIGNATURE,
        .tmr_mmio_registers_p = (lpc2478_timer_t *)LPC2478_TIMER3_BASE_ADDR,
        .tmr_timer_pclk_shift = PCLK_TIMER3,
        .tmr_pclksel_index = 1,
        .tmr_pconp_mask = PCONP_PCTIM3,
    }
};

/**
 * CPU clock cycle counter timer
 */
static const struct timer_device *const g_cpu_clock_cycle_counter_timer_p =
                                            &g_timer_devices[1];

/**
 * McRTOS interrupt object for the UART0 interrupts
 *
 * NOTE: It is used in lpc2478_interrupt_handlers.s.
 */
struct rtos_interrupt *g_rtos_interrupt_uart0 = NULL;
 
/**
 * Global array of non-const structures for UART devices for the LPC2478
 * (allocated in SRAM space)
 */
static struct uart_device_var g_uart_devices_var[] =
{
    [0] = {
        .urt_initialized = false,
        .urt_signal_thre_condvar = false,
        .urt_signal_rdr_condvar = false,
        .urt_byte_received_pending = false,
        .urt_first_byte_received = '\0',
        },

    [1] = {
        .urt_initialized = false,
        .urt_signal_thre_condvar = false,
        .urt_signal_rdr_condvar = false,
        .urt_byte_received_pending = false,
        .urt_first_byte_received = '\0',
        },

