jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
    [2] = {
        .urt_initialized = false,
        .urt_signal_thre_condvar = false,
        .urt_signal_rdr_condvar = false,
        .urt_byte_received_pending = false,
        .urt_first_byte_received = '\0',
        },

    [3] = {
        .urt_initialized = false,
        .urt_signal_thre_condvar = false,
        .urt_signal_rdr_condvar = false,
        .urt_byte_received_pending = false,
        .urt_first_byte_received = '\0',
        },
};

/**
 * Global array of const structures for UART devices for the LPC2478 
 * (allocated in flash space)
 */
static const struct uart_device g_uart_devices[] =
{
    [0] = {
        .urt_signature = UART_DEVICE_SIGNATURE,
        .urt_var_p = &g_uart_devices_var[0],
        .urt_mmio_uart_p = (lpc2478_uart_t *)LPC2478_UART0_BASE_ADDR,
        .urt_uart_pclk = PCLK_UART0,
        .urt_pclksel_index = 0,
        .urt_pconp_mask = PCONP_PCUART0,
        .urt_rtos_interrupt_params = {
            .irp_name_p = "UART0 Interrupt",
            .irp_isr_function_p = isr_uart0,
            .irp_arg_p =  (void *)&g_uart_devices[0],
            .irp_channel = VIC_CHANNEL_UART0,
            .irp_priority = VIC_VECT_PRIORITY6,
            .irp_cpu_id = 0,
        },

        .urt_rtos_interrupt_pp = &g_rtos_interrupt_uart0,
        .urt_thre_condvar_name_p = "UART0 THRE condvar",
        .urt_rdr_condvar_name_p = "UART0 RDR condvar",
    },

    [1] = {
        .urt_signature = UART_DEVICE_SIGNATURE,
        .urt_var_p = &g_uart_devices_var[1],
        .urt_mmio_uart_p = (lpc2478_uart_t *)LPC2478_UART1_BASE_ADDR,
        .urt_uart_pclk = PCLK_UART1,
        .urt_pclksel_index = 0,
        .urt_pconp_mask = PCONP_PCUART1,
    },

    [2] = {
        .urt_signature = UART_DEVICE_SIGNATURE,
        .urt_var_p = &g_uart_devices_var[2],
        .urt_mmio_uart_p = (lpc2478_uart_t *)LPC2478_UART2_BASE_ADDR,
        .urt_uart_pclk = PCLK_UART2,
        .urt_pclksel_index = 1,
        .urt_pconp_mask = PCONP_PCUART2,
    },

    [3] = {
        .urt_signature = UART_DEVICE_SIGNATURE,
        .urt_var_p = &g_uart_devices_var[3],
        .urt_mmio_uart_p = (lpc2478_uart_t *)LPC2478_UART3_BASE_ADDR,
        .urt_uart_pclk = PCLK_UART3,
        .urt_pclksel_index = 1,
        .urt_pconp_mask = PCONP_PCUART3,
    }
};

C_ASSERT(
    ARRAY_SIZE(g_uart_devices) == ARRAY_SIZE(g_uart_devices_var));

const struct uart_device *const g_console_serial_port_p = &g_uart_devices[0];

/*
 *  A/D converter
 */

/**
 * McRTOS interrupt object for the A/D converter interrupts
 *
 * NOTE: It is used in lpc2478_interrupt_handlers.s.
 */
struct rtos_interrupt *g_rtos_interrupt_adc = NULL;
 
/**
 * Global array of non-const structures for A/D converter channels
 * (allocated in SRAM space)
 */
static struct adc_channel g_adc_channels[NUM_ADC_CHANNELS];

/**
 * Global const structure for the A/D converter device
 * (allocated in flash space)
 */
static const struct adc_device g_adc_device = {
    .ad_signature = ADC_DEVICE_SIGNATURE,
    .ad_mmio_registers_p = (lpc2478_adc_t *)LPC2478_ADC_BASE_ADDR,
    .ad_rtos_interrupt_params = {
        .irp_name_p = "ADC Interrupt",
        .irp_isr_function_p = isr_adc,
        .irp_arg_p = (void *)&g_adc_device,
        .irp_channel = VIC_CHANNEL_AD0,
        .irp_priority = VIC_VECT_PRIORITY3,
        .irp_cpu_id = 0,
    },

    .ad_rtos_interrupt_pp = &g_rtos_interrupt_adc,

#   define ADC_CONDVAR_NAME_ENTRY(_channel) \
        [_channel] = "A/D channel " #_channel " condvar"

    .ad_channel_condvar_names = {
        ADC_CONDVAR_NAME_ENTRY(0),
        ADC_CONDVAR_NAME_ENTRY(1),
        ADC_CONDVAR_NAME_ENTRY(2),
        ADC_CONDVAR_NAME_ENTRY(3),
        ADC_CONDVAR_NAME_ENTRY(4),
        ADC_CONDVAR_NAME_ENTRY(5),
        ADC_CONDVAR_NAME_ENTRY(6),
        ADC_CONDVAR_NAME_ENTRY(7),
    },

    .ad_adc_channels_p = g_adc_channels,
};

const struct adc_device *const g_adc_device_p = &g_adc_device;

/*
 * Pin definitions for LEDs
 */

static const struct pin_config_info g_sd_mmc_led_pin =
    PIN_COFIG_INFO_INITIALIZER(
        LED_PINS_GPIO_PORT, SD_MMC_LED_PIN_BIT_INDEX, PINSEL_PRIMARY, true);

static const struct pin_config_info g_usb_host_link_led_pin =
    PIN_COFIG_INFO_INITIALIZER(
        LED_PINS_GPIO_PORT, USB_HOST_LINK_LED_PIN_BIT_INDEX, PINSEL_PRIMARY, false);

static const struct pin_config_info g_usb_device_link_led_pin =
    PIN_COFIG_INFO_INITIALIZER(
        LED_PINS_GPIO_PORT, USB_DEVICE_LINK_LED_PIN_BIT_INDEX, PINSEL_PRIMARY, false);

/**
 * McRTOS interrupt object for the GPIO ports interrupt
 *
 * NOTE: It is used in lpc2478_interrupt_handlers.s.
 */
struct rtos_interrupt *g_rtos_interrupt_gpio_ports = NULL;

/** 
 * Condvar signaled when any of the buttons of the buttons device is pressed
 */
static struct rtos_condvar g_buttons_pressed_condvar;

/**
 * Buttons device
 */

static struct buttons_device_var g_buttons_device_var =
{
    .bd_buttons_pressed_bitmap = 0x0,
};

static const struct buttons_device g_buttons_device =
{
    .bd_signature = BUTTONS_DEVICE_SIGNATURE,
    .bd_var_p = &g_buttons_device_var,
    .bd_gpio_port_index = GPIO_PORT_P2,

    .bd_gpio_mmio_interrupt_registers_p =
        (struct gpio_interrupt_registers *)GPIO_INTERRUPT_REGISTERS_BASE_ADDR,

    .bd_gpio_port_mmio_interrupt_registers_p =
        &((struct gpio_interrupt_registers *)
            GPIO_INTERRUPT_REGISTERS_BASE_ADDR)->gpio_port_p2,

    .bd_button1_pin = 
        PIN_COFIG_INFO_INITIALIZER(
            BUTTON_PINS_GPIO_PORT, BUTTON1_PIN_BIT_INDEX, PINSEL_PRIMARY, false),

    .bd_button2_pin = 
        PIN_COFIG_INFO_INITIALIZER(
            BUTTON_PINS_GPIO_PORT, BUTTON2_PIN_BIT_INDEX, PINSEL_PRIMARY, false),

    .bd_rtos_interrupt_params = {
        .irp_name_p = "GPIO Ports 0 and 2 Interrupt",
        .irp_isr_function_p = isr_gpio_ports,
        .irp_arg_p =  (void *)&g_buttons_device,
        .irp_channel = VIC_CHANNEL_EINT3,
        .irp_priority = VIC_VECT_PRIORITY4,
        .irp_cpu_id = 0,
    },

    .bd_rtos_interrupt_pp = &g_rtos_interrupt_gpio_ports,
    .bd_condvar_name_p = "Buttons pressed condvar",
};

const struct buttons_device *const g_buttons_device_p = &g_buttons_device;

/**
 * Global array of non-const structures for the LPC2478 SSP controllers
 * (allocated in SRAM space)
 */
static struct ssp_controller_var g_ssp_controllers_var[] =
{
    [0] = {
        .sc_interrupt_pending = false,
    },
    [1] = {
        .sc_interrupt_pending = false,
    },
};

/**
 * McRTOS interrupt objects for the SSP controllers
 *
 * NOTE: It is used in lpc2478_interrupt_handlers.s.
 */
struct rtos_interrupt *g_rtos_interrupt_ssp_controller0 = NULL;
struct rtos_interrupt *g_rtos_interrupt_ssp_controller1 = NULL;

/**
 * Global array of const structures for the LPC2478 SSP controllers
 * (allocated in flash space)
 */
static const struct ssp_controller g_ssp_controllers[] =
{
    [0] = {
        .sc_signature = SSP_CONTROLLER_SIGNATURE,
        .sc_var_p = &g_ssp_controllers_var[0],
        .sc_mmio_registers_p = (lpc2478_ssp_t *)LPC2478_SSP0_BASE_ADDR,
        .sc_ssp_pclk_shift = PCLK_SSP0,
        .sc_pclksel_index = 1,
        .sc_pconp_mask = PCONP_PCSSP0,
        .sc_pin_sck =  PIN_COFIG_INFO_INITIALIZER(
            SSP0_PINS_GPIO_PORT, SSP0_SCK_PIN_BIT_INDEX, SSP0_PINS_GPIO_FUNCTION, false),
        .sc_pin_ssel = PIN_COFIG_INFO_INITIALIZER(
            SSP0_PINS_GPIO_PORT, SSP0_SSEL_PIN_BIT_INDEX, SSP0_PINS_GPIO_FUNCTION, false),
        .sc_pin_miso = PIN_COFIG_INFO_INITIALIZER(
            SSP0_PINS_GPIO_PORT, SSP0_MISO_PIN_BIT_INDEX, SSP0_PINS_GPIO_FUNCTION, false),
        .sc_pin_mosi = PIN_COFIG_INFO_INITIALIZER(
            SSP0_PINS_GPIO_PORT, SSP0_MOSI_PIN_BIT_INDEX, SSP0_PINS_GPIO_FUNCTION, false),
        .sc_rtos_interrupt_params = {
            .irp_name_p = "McRTOS SSP controller 0 Interrupt",
            .irp_isr_function_p = isr_ssp_controller0,
            .irp_arg_p =  (void *)&g_ssp_controllers[0],
            .irp_channel = VIC_CHANNEL_SPI_SSP0,
            .irp_priority = VIC_VECT_PRIORITY5,
            .irp_cpu_id = 0,
        },
        .sc_rtos_interrupt_pp = &g_rtos_interrupt_ssp_controller0,
        .sc_condvar_name_p = "SSP controller 0 condvar",
    },
    [1] = {
        .sc_signature = SSP_CONTROLLER_SIGNATURE,
        .sc_var_p = &g_ssp_controllers_var[1],
        .sc_mmio_registers_p = (lpc2478_ssp_t *)LPC2478_SSP1_BASE_ADDR,
        .sc_ssp_pclk_shift = PCLK_SSP1,
        .sc_pclksel_index = 0,
        .sc_pconp_mask = PCONP_PCSSP1,
        .sc_pin_sck =  PIN_COFIG_INFO_INITIALIZER(
            SSP1_PINS_GPIO_PORT, SSP1_SCK_PIN_BIT_INDEX, SSP1_PINS_GPIO_FUNCTION, false),
        .sc_pin_ssel = PIN_COFIG_INFO_INITIALIZER(
            SSP1_PINS_GPIO_PORT, SSP1_SSEL_PIN_BIT_INDEX, SSP1_PINS_GPIO_FUNCTION, false),
        .sc_pin_miso = PIN_COFIG_INFO_INITIALIZER(
            SSP1_PINS_GPIO_PORT, SSP1_MISO_PIN_BIT_INDEX, SSP1_PINS_GPIO_FUNCTION, false),
        .sc_pin_mosi = PIN_COFIG_INFO_INITIALIZER(
            SSP1_PINS_GPIO_PORT, SSP1_MOSI_PIN_BIT_INDEX, SSP1_PINS_GPIO_FUNCTION, false),
        .sc_rtos_interrupt_params = {
            .irp_name_p = "McRTOS SSP controller 1 Interrupt",
            .irp_isr_function_p = isr_ssp_controller1,
            .irp_arg_p =  (void *)&g_ssp_controllers[1],
            .irp_channel = VIC_CHANNEL_SSP1,
            .irp_priority = VIC_VECT_PRIORITY5,
            .irp_cpu_id = 0,
        },
        .sc_rtos_interrupt_pp = &g_rtos_interrupt_ssp_controller1,
        .sc_condvar_name_p = "SSP controller 1 condvar",
    }
};

const struct ssp_controller * const g_ssp0_controller_p = &g_ssp_controllers[0];
const struct ssp_controller * const g_ssp1_controller_p = &g_ssp_controllers[1];

static bool spi_connected = false;
static bool ssp0_connected = false;


/**
 * Turn on power for a give peripheral or set of peripherals
 */
void
turn_on_power(uint32_t pconp_mask)
{
    uint32_t reg_value = read_32bit_mmio_register(&g_scb_mmio_registers_p->reg_PCONP);

