jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
    /*
     * Clear reserved bits. Reading reserved bits is not defined, so the
     * register value read can contain garbage 1's in these bits, and we are
     * not supposed to write 1's to reserved bits.
     */ 
    CLEAR_BIT_FIELD(reg_value, PCONP_RESERVED_MASK);

    reg_value |= pconp_mask;

    write_32bit_mmio_register(
        &g_scb_mmio_registers_p->reg_PCONP, reg_value);
}


static void
write_reg_AD0CR(volatile uint32_t *reg_AD0CR_p, uint32_t reg_value)
{
    /*
     * Clear reserved bits. Reading reserved bits is not defined, so the
     * register value read can contain garbage 1's in these bits, and we are
     * not supposed to write 1's to reserved bits.
     */
    reg_value &= ~AD0CR_RESERVED1_MASK;
    CLEAR_BIT_FIELD(reg_value, AD0CR_RESERVED2_MASK);
    CLEAR_BIT_FIELD(reg_value, AD0CR_RESERVED3_MASK);

    write_32bit_mmio_register(reg_AD0CR_p, reg_value);
}


/**
 * It configures a pin of the LPC2478
 *
 * the 'is_output' parameter is only meaningful if the selected
 * pin function is the primary function (PINSEL_PRIMARY)
 */
void
configure_pin(const struct pin_config_info *pin_info_p, bool is_output)
{
    uint32_t reg_value;
    uint8_t pinsel_mode_index =
            GET_PINSEL_MODE_INDEX(pin_info_p->gpio_port_index,
                                  pin_info_p->pin_bit_index);
    volatile uint32_t *reg_PINSEL_p =
        &g_pin_connect_block->reg_PINSEL[pinsel_mode_index];
    volatile uint32_t *reg_PINMODE_p =
        &g_pin_connect_block->reg_PINMODE[pinsel_mode_index];
    volatile uint32_t *reg_FIODIR_p =
        &g_fast_gpio_ports_array[pin_info_p->gpio_port_index].reg_FIODIR;

    /*
     * Set pin function:
     */
    reg_value = read_32bit_mmio_register(reg_PINSEL_p);
    SET_BIT_FIELD(reg_value,
        pin_info_p->pinsel_mode_mask,
        pin_info_p->pinsel_mode_shift,
        pin_info_p->pin_function);
    write_32bit_mmio_register(reg_PINSEL_p, reg_value);

    /*
     * Set pin mode to neither pull-up nor pull-down enabled:
     */
    reg_value = read_32bit_mmio_register(reg_PINMODE_p);
    SET_BIT_FIELD(reg_value,
        pin_info_p->pinsel_mode_mask,
        pin_info_p->pinsel_mode_shift,
        PINMODE_PULL_NONE);
    write_32bit_mmio_register(reg_PINMODE_p, reg_value);

    if (pin_info_p->pin_function == PINSEL_PRIMARY)
    {
        /*
         * Set pin I/O direction:
         */
        if (is_output)
        {
            /*
             * Initialize pin to be de-asserted, before setting it as an
             * output pin:
             */ 
            deactivate_output_pin(pin_info_p);

            reg_value = read_32bit_mmio_register(reg_FIODIR_p);
            reg_value |= BIT(pin_info_p->pin_bit_index);
            write_32bit_mmio_register(reg_FIODIR_p, reg_value);
        }
        else
        {
            reg_value = read_32bit_mmio_register(reg_FIODIR_p);
            reg_value &= ~BIT(pin_info_p->pin_bit_index);
            write_32bit_mmio_register(reg_FIODIR_p, reg_value);
        }
    }
}


void
activate_output_pin(const struct pin_config_info *pin_info_p)
{
    uint32_t reg_value;
    volatile uint32_t *reg_FIODIR_p =
        &g_fast_gpio_ports_array[pin_info_p->gpio_port_index].reg_FIODIR;

    FDC_ASSERT(
        pin_info_p->pin_function == PINSEL_PRIMARY,
        pin_info_p->pin_function, PINSEL_PRIMARY);

    reg_value = read_32bit_mmio_register(reg_FIODIR_p);
    FDC_ASSERT(
        reg_value & BIT(pin_info_p->pin_bit_index),
        pin_info_p, reg_value);

    if (pin_info_p->pin_is_active_high)
    {
        volatile uint32_t *reg_FIOSET_p =
            &g_fast_gpio_ports_array[pin_info_p->gpio_port_index].reg_FIOSET;
                
        write_32bit_mmio_register(
            reg_FIOSET_p,
            BIT(pin_info_p->pin_bit_index));
    }
    else
    {
        volatile uint32_t *reg_FIOCLR_p =
            &g_fast_gpio_ports_array[pin_info_p->gpio_port_index].reg_FIOCLR;

        write_32bit_mmio_register(
            reg_FIOCLR_p,
            BIT(pin_info_p->pin_bit_index));
    }
}


void
deactivate_output_pin(const struct pin_config_info *pin_info_p)
{
    FDC_ASSERT(
        pin_info_p->pin_function == PINSEL_PRIMARY,
        pin_info_p->pin_function, PINSEL_PRIMARY);

    if (pin_info_p->pin_is_active_high)
    {
        volatile uint32_t *reg_FIOCLR_p =
            &g_fast_gpio_ports_array[pin_info_p->gpio_port_index].reg_FIOCLR;

        write_32bit_mmio_register(
            reg_FIOCLR_p,
            BIT(pin_info_p->pin_bit_index));
    }
    else
    {
        volatile uint32_t *reg_FIOSET_p =
            &g_fast_gpio_ports_array[pin_info_p->gpio_port_index].reg_FIOSET;
                
        write_32bit_mmio_register(
            reg_FIOSET_p,
            BIT(pin_info_p->pin_bit_index));
    }
}


bool
read_input_pin(const struct pin_config_info *pin_info_p)
{
    volatile uint32_t *reg_FIOPIN_p =
        &g_fast_gpio_ports_array[pin_info_p->gpio_port_index].reg_FIOPIN;

    uint32_t reg_value = read_32bit_mmio_register(reg_FIOPIN_p);

    return (reg_value & BIT(pin_info_p->pin_bit_index)) != 0;
}


/**
 *  Initializes SoC hardware
 */
void soc_hardware_init(void)
{
    /* Initial SCB Parameters (CCLK 72MHz) */
    static const struct scbParams sCBParams = {
        .PLL_M_Mul = 12,           /* PLL Multiplier. Valid values 6 through 512*/
        .PLL_N_Div = 1,            /* PLL Divider. Valid values 1 through 32 */
        .PLL_Fcco = 288000000,     /* Frequency (Hz) of PLL output */
        .CCLK_Div = 4,             /* CPU Clock divider, cclk */
        .MAMMode = MAMCR_FULL,     /* MAM mode Partial is the preferred setting for Rev -,A parts */
        .MAMTim = MAMTIM_5_CLK,    /* Override optimal MAM timing due to LPC2478 Rev.C MAM errata */
    };

    uint32_t cclk = sCBParams.PLL_Fcco / sCBParams.CCLK_Div;

    FDC_ASSERT(cclk == CPU_CLOCK_FREQ_IN_HZ, cclk, CPU_CLOCK_FREQ_IN_HZ);

