jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
    /*
     * initialize main hardware components
     */
    /* Must turn off MAM before increasing frequency */
    initMAM(cclk, MAMCR_OFF, MAMTIM_7_CLK);

    /* Disable SDRAM before changing frequency (all data in SDRAM will be lost */
    disableSDRAM();

    initPLL(&sCBParams);
    initMAM(cclk, sCBParams.MAMMode, sCBParams.MAMTim);
    initPCLK();
    initGPIO();

    /* MEMMAP Choices are:
     * BOOTLOADERMODE      0x00
     * USERFLASHMODE       0x01
     * USERRAMMODE         0x02
     * EXTERNALMEMORYMODE  0x03
     */
    g_scb_mmio_registers_p->reg_MEMMAP = USERFLASHMODE;

    initVIC();

    uart_init(
        g_console_serial_port_p,
        DEBUG_SERIAL_PORT_BAUD_RATE,
        DEBUG_SERIAL_PORT_MODE);

    init_leds();

    init_adc(g_adc_device_p);

    /*
     * Initialize timer used for counting CPU clock cycles:
     */
    init_timer(
        g_cpu_clock_cycle_counter_timer_p,
        CPU_CLOCK_CYCLE_COUNTER_TIMER_FREQUENCY,
        false);

    /*
     * Initialize SDRAM:
     */
    initSDRAM(cclk);

    /*
     * Initialize peripherals that use DRAM:
     */
    
    init_lcd();

    TODO("Enable init_ethernet")
    //TODO init_ethernet();
}


/**
 * Initializes the RTOS tick timer for the calling CPU core
 */ 
void
initialize_tick_timer(void)
{
    /**
     * McRTOS tick timers for each CPU core
     */
    static const struct timer_device *const rtos_tick_timers_p[] =
    {
        [0] = &g_timer_devices[0],
    };

    C_ASSERT2(rtos_tick_timers_p_array_size,
        ARRAY_SIZE(rtos_tick_timers_p) == SOC_NUM_CPU_CORES);

    cpu_id_t cpu_id = SOC_GET_CURRENT_CPU_ID();

    rtos_k_register_interrupt(
        &rtos_tick_timers_p[cpu_id]->tmr_rtos_interrupt_params,
        rtos_tick_timers_p[cpu_id]->tmr_rtos_interrupt_pp);

    DBG_ASSERT(
        *rtos_tick_timers_p[cpu_id]->tmr_rtos_interrupt_pp != NULL,
        rtos_tick_timers_p[cpu_id]->tmr_rtos_interrupt_pp, cpu_id);

    init_timer(
        rtos_tick_timers_p[cpu_id],
        RTOS_TICK_TIMER_FREQUENCY,
        true);
}


uint32_t 
get_cpu_clock_cycles(void)
{
    lpc2478_timer_t *timer_mmio_registers_p =
        g_cpu_clock_cycle_counter_timer_p->tmr_mmio_registers_p;

    return read_32bit_mmio_register(&timer_mmio_registers_p->reg_TC) *
           CPU_CLOCK_FREQ_DIVIDER;
}


/******************************************************************************
 *
 * DESCRIPTION
 *
 *  This init is specific to the 2400 family of devices.
 *
 * NOTES
 *
 *  Taken from the LPC2478 User Manual:
 *
 *   5.14 PLL setup sequence
 *
 *   The following sequence must be followed step by step in order to
 *   have the PLL initialized and running:
 *
 *   1. Disconnect the PLL with one feed sequence if PLL is already
 *      connected.
 *   2. Disable the PLL with one feed sequence.
 *   3. Change the CPU Clock Divider setting to speed up operation without
 *      the PLL, if desired.
 *   4. Write to the Clock Source Selection Control register to change the
 *      clock source.
 *   5. Write to the PLLCFG and make it effective with one feed sequence.
 *      The PLLCFG can only be updated when the PLL is disabled.
 *   6. Enable the PLL with one feed sequence.
 *   7. Change the CPU Clock Divider setting for the operation with the
 *      PLL. It's critical to do this before connecting the PLL.
 *   8. Wait for the PLL to achieve lock by monitoring the PLOCK bit in the
 *      PLLSTAT register, or using the PLOCK interrupt, or wait for a fixed
 *      time when the input clock to PLL is slow (i.e. 32 kHz). The value of
 *      PLOCK may not be stable when the PLL reference frequency (FREF, the
 *      frequency of REFCLK, which is equal to the PLL input frequency divided
 *      by the pre-divider value) is less than 100 kHz or greater than 20
 *      MHz. In these cases, the PLL may be assumed to be stable after a
 *      start-up time has passed. This time is 500 us when FREF is
 *      greater than 400 kHz and 200 / FREF seconds when FREF is less than
 *      400kHz.
 *   9. Connect the PLL with one feed sequence.
 *
 *   It's very important not to merge any steps above. For example, don't
 *   update the PLLCFG and enable the PLL simultaneously with the same feed
 *   sequence.
 *
 *
 *  This implementation is fixed as follows:
 * 1. Uses the main oscillator
 * 2. PLL Fcco is fixed at compile time at 288 MHz using external defines
 * 3. It also sets the CCLK to a known stable 48 MHz
 */
static void initPLL(const struct scbParams *pSCBParams)
{
    uint32_t pllcfg;
    fdc_error_t fdc_error;

    /* Validate the incoming parameters based on supported values for the Main OSC */
    if ( pSCBParams->PLL_M_Mul < 6 ||
       pSCBParams->PLL_M_Mul > 512 ||
       pSCBParams->PLL_N_Div < 1 ||
       pSCBParams->PLL_N_Div > 32 ||
       pSCBParams->PLL_Fcco < 275000000 ||
       pSCBParams->PLL_Fcco > 550000000 ||
       pSCBParams->CCLK_Div == 0
        )
    {
      /* invalid value: M, N, Fcco, CCLK_Div */
      fdc_error = CAPTURE_FDC_ERROR("Invalid value: M, N, Fcco, CCLK_Div", pSCBParams, 0);
      fatal_error_handler(fdc_error);
    }

    /* Validate the M and N matches the provided Fcco */
    if ( pSCBParams->PLL_Fcco != ((2 * pSCBParams->PLL_M_Mul * FOSC_MAIN)/pSCBParams->PLL_N_Div) )
    {
      /* invalid M and N or Fcco combinations */
      fdc_error = CAPTURE_FDC_ERROR("Invalid M and N or Fcco combinations", pSCBParams, 0);
      fatal_error_handler(fdc_error);
    }

    /* [1] Check if PLL connected, disconnect if yes. */
    if ((g_scb_mmio_registers_p->reg_PLLSTAT) & PLLSTAT_PLLC)
    {
        g_scb_mmio_registers_p->reg_PLLCON = PLLCON_PLLE;
        /* Enable PLL, disconnected ( PLLC = 0)*/
        g_scb_mmio_registers_p->reg_PLLFEED = 0xAA;
        g_scb_mmio_registers_p->reg_PLLFEED = 0x55;
    }

    /* [2] Disable the PLL once it has been disconnected. */
    g_scb_mmio_registers_p->reg_PLLCON  = 0;
    g_scb_mmio_registers_p->reg_PLLFEED = 0xAA;
    g_scb_mmio_registers_p->reg_PLLFEED = 0x55;

