jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
    /* [3] Change the CPU Clock Divider setting
     * to speed up operation without the PLL, if desired.
     * We're going to divide by 1 for maximum non-PLL clock speed.
     * NOTE: CCLKCFG adds one internally so we must subtract one */
    g_scb_mmio_registers_p->reg_CCLKCFG = (CCLK_DIV_1 - 1);

    /* [4] Enable the main oscillator, select clock source  */
    if( FOSC_MAIN > 20000000 )
    {
        g_scb_mmio_registers_p->reg_SCS |= SCS_OSCRANGE;
    }
    else
    {
        g_scb_mmio_registers_p->reg_SCS &= ~SCS_OSCRANGE;
    }

    g_scb_mmio_registers_p->reg_SCS |= SCS_OSCEN;

    /* Wait until main OSC is usable */
    do {} while ((g_scb_mmio_registers_p->reg_SCS & SCS_OSCSTAT) == 0);

    /* Select the main osc as the PLL clk source. */
    g_scb_mmio_registers_p->reg_CLKSRCSEL = CLKSRC_MAIN_OSC;

    /*
     * NOTES:
     *
     * Set multiplier and divider values.
     *
     *  PLLCFG = ((N - 1) << 16) + (M - 1)
     *
     *  F_cco = (2 * M *F_in)/N
     *      M = 12, N = 1, F_in = 12.000 MHz -> F_cco = 288.000 MHz
     *
     */
    /* [5] Write to the PLLCFG and make it effective with feed sequence */
    pllcfg = (((pSCBParams->PLL_N_Div - 1) << 16) + ((pSCBParams->PLL_M_Mul - 1) << 0));
    g_scb_mmio_registers_p->reg_PLLCFG = pllcfg;
    g_scb_mmio_registers_p->reg_PLLFEED = 0xAA;
    g_scb_mmio_registers_p->reg_PLLFEED = 0x55;

    /* [6] Enable the PLL and make it effective with feed sequence */
    g_scb_mmio_registers_p->reg_PLLCON  = PLLCON_PLLE;
    g_scb_mmio_registers_p->reg_PLLFEED = 0xAA;
    g_scb_mmio_registers_p->reg_PLLFEED = 0x55;

    /* [7] Change the CPU Clock Divider setting for the operation with the PLL.
     *     It's critical to do this before connecting the PLL.
     * NOTE: CCLKCFG adds one internally so we must subtract one
     * Divide F_cco down to get the CCLK output. */
    g_scb_mmio_registers_p->reg_CCLKCFG = (pSCBParams->CCLK_Div - 1);

    /* [8] Wait for the PLL to lock to set frequency
     * TODO extra credit: Add timeout for slow FREF */
    do {} while(((g_scb_mmio_registers_p->reg_PLLSTAT) & PLLSTAT_PLOCK) == 0);
    do {} while(((g_scb_mmio_registers_p->reg_PLLSTAT) & 0x00FF7FFF) != pllcfg);

    /* [9] Enable and connect the PLL as the clock source */
    g_scb_mmio_registers_p->reg_PLLCON = (PLLCON_PLLE | PLLCON_PLLC);
    g_scb_mmio_registers_p->reg_PLLFEED = 0xAA;
    g_scb_mmio_registers_p->reg_PLLFEED = 0x55;

    /* Check connect bit status and wait for connection. */
    do {} while(((g_scb_mmio_registers_p->reg_PLLSTAT) & PLLSTAT_PLLC) == 0);

    return;
}

/*
 * DESCRIPTION
 *
 * enable the MAM accelerator and sets number of clocks used for
 * flash memory fetch.
 *
 * PARAMETERS
 * cclk : CPU Clock Frequency
 * mamcr: MAM mode MAMCR_OFF, MAMCR_PARTIAL, or MAMCR_FULL
 *
 * EXAMPLE
 *
 *   initMAM(12000000, MAMCR_PARTIAL);
 */

static void initMAM(uint32_t cclk, uint8_t mamcr, uint8_t mamtim_override)
{
    /* disable MAM */
    g_scb_mmio_registers_p->reg_MAMCR = MAMCR_OFF;

    /* Either set according to optimally calculated value or override parameter */
    if(mamtim_override == MAMTIM_AUTOCFG)
    {
        g_scb_mmio_registers_p->reg_MAMTIM  = (((cclk)+19999999)/20000000); /* stable setting */
    }
    else if( (mamtim_override > MAMTIM_AUTOCFG) && (mamtim_override <= MAMTIM_MAX_CLK) )
    {
        g_scb_mmio_registers_p->reg_MAMTIM  = mamtim_override;
    }
    else
    {
        /* 
         * invalid value
         * setting to reset value for now 
         */
        (void)CAPTURE_FDC_ERROR(
            "Invalid mamtim_override", mamtim_override, 0);

        g_scb_mmio_registers_p->reg_MAMTIM  = MAMTIM_MAX_CLK;
    }

    g_scb_mmio_registers_p->reg_MAMCR   = mamcr;
}


static uint32_t
getFcclk(void)
{
    uint32_t Fosc;
    uint32_t Fpllclk;
    uint32_t Fcclk;
    uint8_t  clksrcsel;
    uint32_t pllstat;
    uint16_t M_mul;
    uint8_t  N_div;
    uint8_t  plle;
    uint8_t  pllc;

    /* Determine Fosc from configured clock source */
    clksrcsel = g_scb_mmio_registers_p->reg_CLKSRCSEL;
    if( (clksrcsel & CLKSRCSEL_MASK) == CLKSRC_INT_RC )
    {
        Fosc = FOSC_INT_RC;
    }
    else if( (clksrcsel & CLKSRCSEL_MASK) == CLKSRC_MAIN_OSC )
    {
        Fosc = FOSC_MAIN;
    }
    else if( (clksrcsel & CLKSRCSEL_MASK) == CLKSRC_MIN_RTC )
    {
        Fosc = FOSC_RTC;
    }
    else /* Invalid clock source */
    {
        return -1;
    }

    /* Determine Fpllclk based on PLL configuration */
    pllstat = g_scb_mmio_registers_p->reg_PLLSTAT;
    M_mul = (pllstat & PLLSTAT_MSEL_MASK) + 1;
    N_div = ((pllstat & PLLSTAT_NSEL_MASK) >> 16) + 1;
    plle  = (pllstat & PLLSTAT_PLLE) >> 24;
    pllc  = (pllstat & PLLSTAT_PLLC) >> 25;

    if( plle && pllc )
    {
        Fpllclk = (2 * M_mul * Fosc) / N_div;
    }
    else
    {
        Fpllclk = Fosc;
    }

    /* Find out cclk frequency based on CCLKCFG */
    Fcclk = Fpllclk / (g_scb_mmio_registers_p->reg_CCLKCFG + 1);

    return Fcclk;
}

/*
 * NAME
 *
 * initPCLK
 *
 * DESCRIPTION
 *
 * Set the pclk for each peripheral. The default PDIV_4, but we do that
 * explicitly here to make it easier to change them later.
 *
 * PARAMETER
 *
 * none...
 *
 * EXAMPLE
 *
 *   initPCLK();
 *
 * NOTES
 *
 *  none...
 *
 */

static void initPCLK(void)
{
    g_scb_mmio_registers_p->reg_PCLKSEL[0] =
    (
          SET_PCLK (PCLK_WDT,     PDIV_4)
        | SET_PCLK (PCLK_TIMER0,  PDIV_1)
        | SET_PCLK (PCLK_TIMER1,  PDIV_1)
        | SET_PCLK (PCLK_UART0,   PDIV_1)
        | SET_PCLK (PCLK_UART1,   PDIV_1)
        | SET_PCLK (PCLK_PWM1,    PDIV_4)
        | SET_PCLK (PCLK_I2C0,    PDIV_4)
        | SET_PCLK (PCLK_SPI,     PDIV_4)
        | SET_PCLK (PCLK_RTC,     PDIV_4)
        | SET_PCLK (PCLK_SSP1,    PDIV_4)
        | SET_PCLK (PCLK_DAC,     PDIV_4)
        | SET_PCLK (PCLK_ADC,     PDIV_4)
        | SET_PCLK (PCLK_CAN1,    PDIV_4)
        | SET_PCLK (PCLK_CAN2,    PDIV_4)
        | SET_PCLK (PCLK_ACF,     PDIV_4)
    );

    g_scb_mmio_registers_p->reg_PCLKSEL[1] =
    (
          SET_PCLK (PCLK_BAT_RAM, PDIV_4)
        | SET_PCLK (PCLK_GPIO,    PDIV_4)
        | SET_PCLK (PCLK_PCB,     PDIV_4)
        | SET_PCLK (PCLK_I2C1,    PDIV_4)
        | SET_PCLK (PCLK_SSP0,    PDIV_4)
        | SET_PCLK (PCLK_TIMER2,  PDIV_4)
        | SET_PCLK (PCLK_TIMER3,  PDIV_4)
        | SET_PCLK (PCLK_UART2,   PDIV_1)
        | SET_PCLK (PCLK_UART3,   PDIV_1)
        | SET_PCLK (PCLK_I2C2,    PDIV_4)
        | SET_PCLK (PCLK_I2S,     PDIV_4)
        | SET_PCLK (PCLK_MCI,     PDIV_4)
        | SET_PCLK (PCLK_SYSCON,  PDIV_4)
    );
}


static void initGPIO(void)
{
    DBG_ASSERT_EQUAL(
        &g_fast_gpio_ports_array[GPIO_PORT_P0], FIO_BASE_ADDR);
    DBG_ASSERT_EQUAL(
        &g_fast_gpio_ports_array[GPIO_PORT_P1], FIO_BASE_ADDR + FAST_GPIO_PORT_SIZE);
    DBG_ASSERT_EQUAL(
        &g_fast_gpio_ports_array[GPIO_PORT_P2], FIO_BASE_ADDR + FAST_GPIO_PORT_SIZE*2);
    DBG_ASSERT_EQUAL(
        &g_fast_gpio_ports_array[GPIO_PORT_P3], FIO_BASE_ADDR + FAST_GPIO_PORT_SIZE*3);
    DBG_ASSERT_EQUAL(
        &g_fast_gpio_ports_array[GPIO_PORT_P4], FIO_BASE_ADDR + FAST_GPIO_PORT_SIZE*4);

