jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
    //TODO:
    TODO("Use PINSEL_PRIMARY for all pins and move P0.2, P0.3 to uart_init for UART0 and use a loop here")

    g_pin_connect_block->reg_PINSEL[0] =
    (
          PINSEL_MASK( PINSEL_PRIMARY, 0 )  /* P0.0  */
        | PINSEL_MASK( PINSEL_PRIMARY, 1 )  /* P0.1  */
        | PINSEL_MASK( PINSEL_ALT_01 , 2 )  /* P0.2 TXD0 - UART0 */
        | PINSEL_MASK( PINSEL_ALT_01 , 3 )  /* P0.3 RXD0 - UART0 */
        | PINSEL_MASK( PINSEL_PRIMARY, 4 )  /* P0.4  */
        | PINSEL_MASK( PINSEL_PRIMARY, 5 )  /* P0.5  */
        | PINSEL_MASK( PINSEL_PRIMARY, 6 )  /* P0.6  */
        | PINSEL_MASK( PINSEL_PRIMARY, 7 )  /* P0.7  */
        | PINSEL_MASK( PINSEL_PRIMARY, 8 )  /* P0.8  */
        | PINSEL_MASK( PINSEL_PRIMARY, 9 )  /* P0.9  */
        | PINSEL_MASK( PINSEL_PRIMARY,10 )  /* P0.10 */
        | PINSEL_MASK( PINSEL_PRIMARY,11 )  /* P0.11 */
        | PINSEL_MASK( PINSEL_PRIMARY,12 )  /* P0.12 */
        | PINSEL_MASK( PINSEL_PRIMARY,13 )  /* P0.13 */
        | PINSEL_MASK( PINSEL_PRIMARY,14 )  /* P0.14 */
        | PINSEL_MASK( PINSEL_PRIMARY,15 )  /* P0.15 */
    );

    g_pin_connect_block->reg_PINSEL[1] =
    (
          PINSEL_MASK( PINSEL_PRIMARY, 0 )  /* P0.16 */
        | PINSEL_MASK( PINSEL_PRIMARY, 1 )  /* P0.17 */
        | PINSEL_MASK( PINSEL_PRIMARY, 2 )  /* P0.18 */
        | PINSEL_MASK( PINSEL_PRIMARY, 3 )  /* P0.19 */
        | PINSEL_MASK( PINSEL_PRIMARY, 4 )  /* P0.20 */
        | PINSEL_MASK( PINSEL_PRIMARY, 5 )  /* P0.21 */
        | PINSEL_MASK( PINSEL_PRIMARY, 6 )  /* P0.22 */
        | PINSEL_MASK( PINSEL_PRIMARY, 7 )  /* P0.23 */
        | PINSEL_MASK( PINSEL_PRIMARY, 8 )  /* P0.24 */
        | PINSEL_MASK( PINSEL_PRIMARY, 9 )  /* P0.25 */
        | PINSEL_MASK( PINSEL_PRIMARY,10 )  /* P0.26 */
        | PINSEL_MASK( PINSEL_PRIMARY,11 )  /* P0.27 */
        | PINSEL_MASK( PINSEL_PRIMARY,12 )  /* P0.28 */
        | PINSEL_MASK( PINSEL_PRIMARY,13 )  /* P0.29 */
        | PINSEL_MASK( PINSEL_PRIMARY,14 )  /* P0.30 */
        | PINSEL_MASK( PINSEL_PRIMARY,15 )  /* P0.31 */
    );

    /* PORT1 */
    g_pin_connect_block->reg_PINSEL[2] =
    (
          PINSEL_MASK( PINSEL_PRIMARY, 0 )  /* P1.0  */
        | PINSEL_MASK( PINSEL_PRIMARY, 1 )  /* P1.1  */
        | PINSEL_MASK( PINSEL_PRIMARY, 2 )  /* P1.2  */
        | PINSEL_MASK( PINSEL_PRIMARY, 3 )  /* P1.3  */
        | PINSEL_MASK( PINSEL_PRIMARY, 4 )  /* P1.4  */
        | PINSEL_MASK( PINSEL_PRIMARY, 5 )  /* P1.5  */
        | PINSEL_MASK( PINSEL_PRIMARY, 6 )  /* P1.6  */
        | PINSEL_MASK( PINSEL_PRIMARY, 7 )  /* P1.7  */
        | PINSEL_MASK( PINSEL_PRIMARY, 8 )  /* P1.8  */
        | PINSEL_MASK( PINSEL_PRIMARY, 9 )  /* P1.9  */
        | PINSEL_MASK( PINSEL_PRIMARY,10 )  /* P1.10 */
        | PINSEL_MASK( PINSEL_PRIMARY,11 )  /* P1.11 */
        | PINSEL_MASK( PINSEL_PRIMARY,12 )  /* P1.12 */
        | PINSEL_MASK( PINSEL_PRIMARY,13 )  /* P1.13 */
        | PINSEL_MASK( PINSEL_PRIMARY,14 )  /* P1.14 */
        | PINSEL_MASK( PINSEL_PRIMARY,15 )  /* P1.15 */
    );

    g_pin_connect_block->reg_PINSEL[3] =
    (
          PINSEL_MASK( PINSEL_PRIMARY, 0 )  /* P1.16 */
        | PINSEL_MASK( PINSEL_PRIMARY, 1 )  /* P1.17 */
        | PINSEL_MASK( PINSEL_PRIMARY, 2 )  /* P1.18 */
        | PINSEL_MASK( PINSEL_PRIMARY, 3 )  /* P1.19 */
        | PINSEL_MASK( PINSEL_PRIMARY, 4 )  /* P1.20 */
        | PINSEL_MASK( PINSEL_PRIMARY, 5 )  /* P1.21 */
        | PINSEL_MASK( PINSEL_PRIMARY, 6 )  /* P1.22 */
        | PINSEL_MASK( PINSEL_PRIMARY, 7 )  /* P1.23 */
        | PINSEL_MASK( PINSEL_PRIMARY, 8 )  /* P1.24 */
        | PINSEL_MASK( PINSEL_PRIMARY, 9 )  /* P1.25 */
        | PINSEL_MASK( PINSEL_PRIMARY,10 )  /* P1.26 */
        | PINSEL_MASK( PINSEL_PRIMARY,11 )  /* P1.27 */
        | PINSEL_MASK( PINSEL_PRIMARY,12 )  /* P1.28 */
        | PINSEL_MASK( PINSEL_PRIMARY,13 )  /* P1.29 */
        | PINSEL_MASK( PINSEL_PRIMARY,14 )  /* P1.30 */
        | PINSEL_MASK( PINSEL_PRIMARY,15 )  /* P1.31 */
    );

    /* PORT2 */
    g_pin_connect_block->reg_PINSEL[4] =
    (
          PINSEL_MASK( PINSEL_PRIMARY, 0 )  /* P2.0  */
        | PINSEL_MASK( PINSEL_PRIMARY, 1 )  /* P2.1  */
        | PINSEL_MASK( PINSEL_PRIMARY, 2 )  /* P2.2  */
        | PINSEL_MASK( PINSEL_PRIMARY, 3 )  /* P2.3  */
        | PINSEL_MASK( PINSEL_PRIMARY, 4 )  /* P2.4  */
        | PINSEL_MASK( PINSEL_PRIMARY, 5 )  /* P2.5  */
        | PINSEL_MASK( PINSEL_PRIMARY, 6 )  /* P2.6  */
        | PINSEL_MASK( PINSEL_PRIMARY, 7 )  /* P2.7  */
        | PINSEL_MASK( PINSEL_PRIMARY, 8 )  /* P2.8  */
        | PINSEL_MASK( PINSEL_PRIMARY, 9 )  /* P2.9  */
        | PINSEL_MASK( PINSEL_PRIMARY,10 )  /* P2.10 */
        | PINSEL_MASK( PINSEL_PRIMARY,11 )  /* P2.11 */
        | PINSEL_MASK( PINSEL_PRIMARY,12 )  /* P2.12 */
        | PINSEL_MASK( PINSEL_PRIMARY,13 )  /* P2.13 */
        | PINSEL_MASK( PINSEL_PRIMARY,14 )  /* P2.14 */
        | PINSEL_MASK( PINSEL_PRIMARY,15 )  /* P2.15 */
    );

    g_pin_connect_block->reg_PINSEL[5] =
    (
          PINSEL_MASK( PINSEL_PRIMARY, 0 )  /* P2.16 */
        | PINSEL_MASK( PINSEL_PRIMARY, 1 )  /* P2.17 */
        | PINSEL_MASK( PINSEL_PRIMARY, 2 )  /* P2.18 */
        | PINSEL_MASK( PINSEL_PRIMARY, 3 )  /* P2.19 */
        | PINSEL_MASK( PINSEL_PRIMARY, 4 )  /* P2.20 */
        | PINSEL_MASK( PINSEL_PRIMARY, 5 )  /* P2.21 */
        | PINSEL_MASK( PINSEL_PRIMARY, 6 )  /* P2.22 */
        | PINSEL_MASK( PINSEL_PRIMARY, 7 )  /* P2.23 */
        | PINSEL_MASK( PINSEL_PRIMARY, 8 )  /* P2.24 */
        | PINSEL_MASK( PINSEL_PRIMARY, 9 )  /* P2.25 */
        | PINSEL_MASK( PINSEL_PRIMARY,10 )  /* P2.26 */
        | PINSEL_MASK( PINSEL_PRIMARY,11 )  /* P2.27 */
        | PINSEL_MASK( PINSEL_PRIMARY,12 )  /* P2.28 */
        | PINSEL_MASK( PINSEL_PRIMARY,13 )  /* P2.29 */
        | PINSEL_MASK( PINSEL_PRIMARY,14 )  /* P2.30 */
        | PINSEL_MASK( PINSEL_PRIMARY,15 )  /* P2.31 */
    );

