jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
    /* PORT3 */
    g_pin_connect_block->reg_PINSEL[6] =
    (
          PINSEL_MASK( PINSEL_PRIMARY, 0 )  /* P3.0  */
        | PINSEL_MASK( PINSEL_PRIMARY, 1 )  /* P3.1  */
        | PINSEL_MASK( PINSEL_PRIMARY, 2 )  /* P3.2  */
        | PINSEL_MASK( PINSEL_PRIMARY, 3 )  /* P3.3  */
        | PINSEL_MASK( PINSEL_PRIMARY, 4 )  /* P3.4  */
        | PINSEL_MASK( PINSEL_PRIMARY, 5 )  /* P3.5  */
        | PINSEL_MASK( PINSEL_PRIMARY, 6 )  /* P3.6  */
        | PINSEL_MASK( PINSEL_PRIMARY, 7 )  /* P3.7  */
        | PINSEL_MASK( PINSEL_PRIMARY, 8 )  /* P3.8  */
        | PINSEL_MASK( PINSEL_PRIMARY, 9 )  /* P3.9  */
        | PINSEL_MASK( PINSEL_PRIMARY,10 )  /* P3.10 */
        | PINSEL_MASK( PINSEL_PRIMARY,11 )  /* P3.11 */
        | PINSEL_MASK( PINSEL_PRIMARY,12 )  /* P3.12 */
        | PINSEL_MASK( PINSEL_PRIMARY,13 )  /* P3.13 */
        | PINSEL_MASK( PINSEL_PRIMARY,14 )  /* P3.14 */
        | PINSEL_MASK( PINSEL_PRIMARY,15 )  /* P3.15 */
    );

    g_pin_connect_block->reg_PINSEL[7] =
    (
          PINSEL_MASK( PINSEL_PRIMARY, 0 )  /* P3.16 */
        | PINSEL_MASK( PINSEL_PRIMARY, 1 )  /* P3.17 */
        | PINSEL_MASK( PINSEL_PRIMARY, 2 )  /* P3.18 */
        | PINSEL_MASK( PINSEL_PRIMARY, 3 )  /* P3.19 */
        | PINSEL_MASK( PINSEL_PRIMARY, 4 )  /* P3.20 */
        | PINSEL_MASK( PINSEL_PRIMARY, 5 )  /* P3.21 */
        | PINSEL_MASK( PINSEL_PRIMARY, 6 )  /* P3.22 */
        | PINSEL_MASK( PINSEL_PRIMARY, 7 )  /* P3.23 */
        | PINSEL_MASK( PINSEL_PRIMARY, 8 )  /* P3.24 */
        | PINSEL_MASK( PINSEL_PRIMARY, 9 )  /* P3.25 */
        | PINSEL_MASK( PINSEL_PRIMARY,10 )  /* P3.26 */
        | PINSEL_MASK( PINSEL_PRIMARY,11 )  /* P3.27 */
        | PINSEL_MASK( PINSEL_PRIMARY,12 )  /* P3.28 */
        | PINSEL_MASK( PINSEL_PRIMARY,13 )  /* P3.29 */
        | PINSEL_MASK( PINSEL_PRIMARY,14 )  /* P3.30 */
        | PINSEL_MASK( PINSEL_PRIMARY,15 )  /* P3.31 */
    );

    /* PORT4 */
    g_pin_connect_block->reg_PINSEL[8] =
    (
          PINSEL_MASK( PINSEL_PRIMARY, 0 )  /* P4.0  */
        | PINSEL_MASK( PINSEL_PRIMARY, 1 )  /* P4.1  */
        | PINSEL_MASK( PINSEL_PRIMARY, 2 )  /* P4.2  */
        | PINSEL_MASK( PINSEL_PRIMARY, 3 )  /* P4.3  */
        | PINSEL_MASK( PINSEL_PRIMARY, 4 )  /* P4.4  */
        | PINSEL_MASK( PINSEL_PRIMARY, 5 )  /* P4.5  */
        | PINSEL_MASK( PINSEL_PRIMARY, 6 )  /* P4.6  */
        | PINSEL_MASK( PINSEL_PRIMARY, 7 )  /* P4.7  */
        | PINSEL_MASK( PINSEL_PRIMARY, 8 )  /* P4.8  */
        | PINSEL_MASK( PINSEL_PRIMARY, 9 )  /* P4.9  */
        | PINSEL_MASK( PINSEL_PRIMARY,10 )  /* P4.10 */
        | PINSEL_MASK( PINSEL_PRIMARY,11 )  /* P4.11 */
        | PINSEL_MASK( PINSEL_PRIMARY,12 )  /* P4.12 */
        | PINSEL_MASK( PINSEL_PRIMARY,13 )  /* P4.13 */
        | PINSEL_MASK( PINSEL_PRIMARY,14 )  /* P4.14 */
        | PINSEL_MASK( PINSEL_PRIMARY,15 )  /* P4.15 */
    );

    g_pin_connect_block->reg_PINSEL[9] =
    (
          PINSEL_MASK( PINSEL_PRIMARY, 0 )  /* P4.16 */
        | PINSEL_MASK( PINSEL_PRIMARY, 1 )  /* P4.17 */
        | PINSEL_MASK( PINSEL_PRIMARY, 2 )  /* P4.18 */
        | PINSEL_MASK( PINSEL_PRIMARY, 3 )  /* P4.19 */
        | PINSEL_MASK( PINSEL_PRIMARY, 4 )  /* P4.20 */
        | PINSEL_MASK( PINSEL_PRIMARY, 5 )  /* P4.21 */
        | PINSEL_MASK( PINSEL_PRIMARY, 6 )  /* P4.22 */
        | PINSEL_MASK( PINSEL_PRIMARY, 7 )  /* P4.23 */
        | PINSEL_MASK( PINSEL_PRIMARY, 8 )  /* P4.24 */
        | PINSEL_MASK( PINSEL_PRIMARY, 9 )  /* P4.25 */
        | PINSEL_MASK( PINSEL_PRIMARY,10 )  /* P4.26 */
        | PINSEL_MASK( PINSEL_PRIMARY,11 )  /* P4.27 */
        | PINSEL_MASK( PINSEL_PRIMARY,12 )  /* P4.28 */
        | PINSEL_MASK( PINSEL_PRIMARY,13 )  /* P4.29 */
        | PINSEL_MASK( PINSEL_PRIMARY,14 )  /* P4.30 */
        | PINSEL_MASK( PINSEL_PRIMARY,15 )  /* P4.31 */
    );

    g_pin_connect_block->reg_PINSEL[10] = ~(BIT(3)) & PINSEL10_MASK;   /* disable ETM, mask reserved bit to 0 */

    /*
     * NOTE:
     *
     *  SCS controls whether the LPC2478 is set to use the legacy registers or the new
     *  fast GPIO control registers.
     *
     */

    g_scb_mmio_registers_p->reg_SCS |= BIT(0);  /* Fast GPIO / new registers */

    /*
     * Disable generation of all falling edge and rising edge interrupts for
     * GPIO ports P0 and P2:
     */
    struct gpio_interrupt_registers *gpio_interrupt_registers_p =
        (struct gpio_interrupt_registers *)GPIO_INTERRUPT_REGISTERS_BASE_ADDR;

    write_32bit_mmio_register(
        &gpio_interrupt_registers_p->gpio_port_p0.reg_IntEnF, 0x0);

    write_32bit_mmio_register(
        &gpio_interrupt_registers_p->gpio_port_p0.reg_IntEnR, 0x0);

    write_32bit_mmio_register(
        &gpio_interrupt_registers_p->gpio_port_p2.reg_IntEnF, 0x0);

    write_32bit_mmio_register(
        &gpio_interrupt_registers_p->gpio_port_p2.reg_IntEnR, 0x0);

    /*
     * Clear any leftover interrupts:
     */
    write_32bit_mmio_register(
        &gpio_interrupt_registers_p->gpio_port_p0.reg_IntClr, UINT32_MAX);
    write_32bit_mmio_register(
        &gpio_interrupt_registers_p->gpio_port_p2.reg_IntClr, UINT32_MAX);

}


void
uart_init(
    const struct uart_device *uart_p,
    uint32_t baud,
    uint8_t mode)
{
    init_uart_internal(
        (struct uart_device *)uart_p, baud, mode, UART_FIFO_OFF,
        CPU_CLOCK_FREQ_IN_HZ);
}


static void
init_uart_internal(
    const struct uart_device *uart_device_p,
    uint32_t baud,
    uint8_t mode,
    uint8_t fmode,
    uint32_t cclk)
{
    uint8_t pclk_div;
    uint8_t pclk_sel;
    uint32_t uart_divisor_latch;
    uint8_t udl_roundbit;
    fdc_error_t fdc_error;
    struct uart_device_var *const uart_var_p = uart_device_p->urt_var_p;
    lpc2478_uart_t *const uart_mmio_registers_p = uart_device_p->urt_mmio_uart_p;
    uint32_t uart_pclk = uart_device_p->urt_uart_pclk;
    uint32_t pclksel_index = uart_device_p->urt_pclksel_index;
    cpu_id_t cpu_id = SOC_GET_CURRENT_CPU_ID();

