jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
    FDC_ASSERT(!uart_var_p->urt_initialized, 0, 0);

    turn_on_power(uart_device_p->urt_pconp_mask);

    /* find out the UART's pclk divider */
    pclk_sel = GET_PCLK_SEL(g_scb_mmio_registers_p->reg_PCLKSEL[pclksel_index], uart_pclk);
    pclk_div = ( pclk_sel == 0 ? 4 : \
                 pclk_sel == 1 ? 1 : \
                 pclk_sel == 2 ? 2 : \
                 pclk_sel == 3 ? 8 : \
                 0 ); /* this evaluation should never happen */
    if( pclk_div == 0 )
    {
        fdc_error = CAPTURE_FDC_ERROR("Invalid UART's pclk_sel", pclk_sel, 0);
        fatal_error_handler(fdc_error);
    }

    /* Calculate divisor latch value based on cclk and the UART's pclk divider
     * uart_divisor_latch = cclk/(16 * pclk_div * baud)
     * We effectively multiply by 2 to determine if it is odd or even
     * If it is even, then there is no round bit
     * If it is odd, then there is a round up
     * Shift it back */
    uart_divisor_latch = cclk/(pclk_div * baud * 8);
    udl_roundbit = ( (uart_divisor_latch & 0x1) == 0 ? 0 : 1 );
    uart_divisor_latch /= 2;
    /* TODO extra credit: use fractional dividers */

    /* stop any transmissions */
    uart_mmio_registers_p->reg_TER = 0;

    uart_mmio_registers_p->reg_LCR = ULCR_DLAB_ENABLE;
    uart_mmio_registers_p->reg_DLL = (uint8_t) uart_divisor_latch + udl_roundbit;
    uart_mmio_registers_p->reg_DLM = (uint8_t)(uart_divisor_latch >> 8);
    uart_mmio_registers_p->reg_LCR = (mode & ~ULCR_DLAB_ENABLE);

    /* Set FIFO modes and Reset */
    uart_mmio_registers_p->reg_FCR = fmode | UFCR_TXFIFO_RESET | UFCR_RXFIFO_RESET;

    /*
     * Initialize condition variables:
     */

    rtos_k_condvar_init(
        uart_device_p->urt_thre_condvar_name_p,
        cpu_id,
        &uart_device_p->urt_var_p->urt_thre_condvar);

    rtos_k_condvar_init(
        uart_device_p->urt_rdr_condvar_name_p,
        cpu_id,
        &uart_device_p->urt_var_p->urt_rdr_condvar);

    /* 
     * Register McRTOS interrupt handler
     */
    rtos_k_register_interrupt(
        &uart_device_p->urt_rtos_interrupt_params,
        uart_device_p->urt_rtos_interrupt_pp);

    DBG_ASSERT(
        *uart_device_p->urt_rtos_interrupt_pp != NULL, 
        uart_device_p->urt_rtos_interrupt_pp, uart_device_p);

    /*
     * Enable generation of UART THRE interrupts:
     */
    uint32_t reg_value = read_32bit_mmio_register(&uart_mmio_registers_p->reg_IER);
    reg_value |= UART_IER_THRE_INTERRUPT_ENABLE_MASK;
    write_32bit_mmio_register(&uart_mmio_registers_p->reg_IER, reg_value);

    /* 
     * Enable transmissions:
     */
    uart_mmio_registers_p->reg_TER = UTER_TXEN;

    uart_var_p->urt_initialized = true;
}


/**
 * UART interrupt pre-handler
 */ 
void
uart_interrupt_pre_handler(
    _IN_ const struct uart_device *uart_device_p)
{
    DBG_ASSERT_CPU_INTERRUPTS_DISABLED();
    DBG_ASSERT(
        uart_device_p->urt_signature == UART_DEVICE_SIGNATURE,
        uart_device_p->urt_signature, uart_device_p);

    uint32_t reg_value;
    struct uart_device_var *const uart_var_p = uart_device_p->urt_var_p;
    lpc2478_uart_t *const uart_mmio_registers_p = uart_device_p->urt_mmio_uart_p;

    DBG_ASSERT(
        uart_var_p->urt_initialized, uart_device_p, 0);

    reg_value = read_32bit_mmio_register(&uart_mmio_registers_p->reg_IIR);

    /*
     * There is at least one interrupt pending
     * (interrupt status bit is asserted low)
     */
    FDC_ASSERT(
        (reg_value & UART_IIR_INT_STATUS_MASK) == 0,
        reg_value, uart_device_p);
    
    uart_interrupt_id_t interrupt_id =
        GET_BIT_FIELD(
            reg_value, UART_IIR_INT_ID_MASK, UART_IIR_INT_ID_SHIFT);

    uint8_t reg_lsr_value = read_8bit_mmio_register(&uart_mmio_registers_p->reg_LSR);

    switch(interrupt_id)
    {
        case UART_INT_TRANSMIT_HOLDING_REGISTER_EMPTY:
            FDC_ASSERT(
                reg_lsr_value & UART_LSR_THRE_MASK,
                reg_lsr_value, uart_device_p);

            /*
             * NOTE: Nothing explicit needs to be done to clear this interrupt,
             * as just having read the IIR above cleared this interrupt:
             */

            DBG_ASSERT(
                !uart_var_p->urt_signal_thre_condvar,
                uart_device_p, 0);

            uart_var_p->urt_signal_thre_condvar = true;
            break;

        case UART_INT_RECEIVE_DATA_AVAILABLE:
  
            FDC_ASSERT(
                reg_lsr_value & UART_LSR_RDR_MASK,
                reg_lsr_value, uart_device_p);

           /*
             * Read the first byte from the Receive FIFO to clear the
             * interrupt source. 
             */
            uart_var_p->urt_first_byte_received =
                read_8bit_mmio_register(&uart_mmio_registers_p->reg_RBR);
           
            DBG_ASSERT(
                !uart_var_p->urt_byte_received_pending,
                uart_var_p, 0);

            uart_var_p->urt_byte_received_pending = true;

            /*
             * Disable further generation of RDA interrupts, until uart_getchar() gets
             * the chance to drain the UART Rx fifo.
             */
            reg_value = read_32bit_mmio_register(&uart_mmio_registers_p->reg_IER);
            reg_value &= ~UART_IER_RDA_INTERRUPT_ENABLE_MASK;
            write_32bit_mmio_register(&uart_mmio_registers_p->reg_IER, reg_value);

            DBG_ASSERT(
                !uart_var_p->urt_signal_rdr_condvar,
                uart_device_p, 0);

            uart_var_p->urt_signal_rdr_condvar = true;
            break;

        case UART_INT_RECEIVE_LINE_STATUS:
            break;

        case UART_INT_CHARACTER_TIMEOUT_INDICATOR:
            break;

        default:
            FDC_ASSERT(false, interrupt_id, uart_device_p);
    }
}


/**
 * UART interrupt post-handler
 */
void
uart_interrupt_post_handler(
    _IN_ const struct uart_device *uart_device_p)
{
    DBG_ASSERT(
        uart_device_p->urt_signature == UART_DEVICE_SIGNATURE,
        uart_device_p->urt_signature, uart_device_p);

    struct uart_device_var *const uart_var_p = uart_device_p->urt_var_p;

    FDC_ASSERT_RTOS_INTERRUPT_HANDLER_PRECONDITIONS(
        *uart_device_p->urt_rtos_interrupt_pp);

    if (uart_var_p->urt_signal_thre_condvar)
    {
        uart_var_p->urt_signal_thre_condvar = false;

        rtos_k_condvar_signal(&uart_var_p->urt_thre_condvar);
    }
    else if (uart_var_p->urt_signal_rdr_condvar)
    {
        uart_var_p->urt_signal_rdr_condvar = false;

        rtos_k_condvar_signal(&uart_var_p->urt_rdr_condvar);
    }
}


/* initVIC is used to
 * 1. initialize the VIC to a known state by writing all registers with their
 *    reset values
 * 2. configures system-wide
 * This is useful if only a soft-reset occurred that does not
 * perform a full reset of the hardware
 */
static void initVIC(void)
{
#   define GENERATE_ARRAY_ENTRY(_peripheral_name,                           \
                                _vic_interrupt_channel)                     \
            [_vic_interrupt_channel] =                                      \
                dummy_ ## _peripheral_name ## _isr,

    uint32_t i;

    static isr_function_t *const g_dummy_isr_functions[] =
    {
        GENERATE_ARRAY_ENTRY(wdt, VIC_CHANNEL_WDT)
        GENERATE_ARRAY_ENTRY(softint, VIC_CHANNEL_SOFTINT)
        GENERATE_ARRAY_ENTRY(armcore0, VIC_CHANNEL_ARMCORE0)
        GENERATE_ARRAY_ENTRY(armcore1, VIC_CHANNEL_ARMCORE1)
        GENERATE_ARRAY_ENTRY(timer0, VIC_CHANNEL_TIMER0)
        GENERATE_ARRAY_ENTRY(timer1, VIC_CHANNEL_TIMER1)
        GENERATE_ARRAY_ENTRY(uart0, VIC_CHANNEL_UART0)
        GENERATE_ARRAY_ENTRY(uart1, VIC_CHANNEL_UART1)
        GENERATE_ARRAY_ENTRY(pwm0_1, VIC_CHANNEL_PWM0_1)
        GENERATE_ARRAY_ENTRY(i2c0, VIC_CHANNEL_I2C0)
        GENERATE_ARRAY_ENTRY(spi_ssp0, VIC_CHANNEL_SPI_SSP0)
        GENERATE_ARRAY_ENTRY(ssp1, VIC_CHANNEL_SSP1)
        GENERATE_ARRAY_ENTRY(pll, VIC_CHANNEL_PLL)
        GENERATE_ARRAY_ENTRY(rtc, VIC_CHANNEL_RTC)
        GENERATE_ARRAY_ENTRY(eint0, VIC_CHANNEL_EINT0)
        GENERATE_ARRAY_ENTRY(eint1, VIC_CHANNEL_EINT1)
        GENERATE_ARRAY_ENTRY(eint2, VIC_CHANNEL_EINT2)
        GENERATE_ARRAY_ENTRY(eint3, VIC_CHANNEL_EINT3)
        GENERATE_ARRAY_ENTRY(ad0, VIC_CHANNEL_AD0)
        GENERATE_ARRAY_ENTRY(i2c1, VIC_CHANNEL_I2C1)
        GENERATE_ARRAY_ENTRY(bod, VIC_CHANNEL_BOD)
        GENERATE_ARRAY_ENTRY(ethernet, VIC_CHANNEL_ETHERNET)
        GENERATE_ARRAY_ENTRY(usb, VIC_CHANNEL_USB)
        GENERATE_ARRAY_ENTRY(can, VIC_CHANNEL_CAN)
        GENERATE_ARRAY_ENTRY(sd_mmc, VIC_CHANNEL_SD_MMC)
        GENERATE_ARRAY_ENTRY(gpdma, VIC_CHANNEL_GPDMA)
        GENERATE_ARRAY_ENTRY(timer2, VIC_CHANNEL_TIMER2)
        GENERATE_ARRAY_ENTRY(timer3, VIC_CHANNEL_TIMER3)
        GENERATE_ARRAY_ENTRY(uart2, VIC_CHANNEL_UART2)
        GENERATE_ARRAY_ENTRY(uart3, VIC_CHANNEL_UART3)
        GENERATE_ARRAY_ENTRY(i2c2, VIC_CHANNEL_I2C2)
        GENERATE_ARRAY_ENTRY(i2s, VIC_CHANNEL_I2S)
    };

#   undef GENERATE_ARRAY_ENTRY

    C_ASSERT2(check_g_dummy_isr_functions_array_size,
              ARRAY_SIZE(g_dummy_isr_functions) == SOC_NUM_INTERRUPT_CHANNELS);

