jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
    /*
     * Disable interrupts in the ARM core
     */
    cpu_status_register_t cpu_status_register = rtos_k_disable_cpu_interrupts();

    /* Clear any leftover pending software generated interrupts */
    g_vic_mmio_registers_p->reg_VICSoftIntClear = ALL_VIC_CHANNELS_MASK;

    /* Clear all interrupt enable bits, mask all interrupt sources */
    g_vic_mmio_registers_p->reg_VICIntEnClear = ALL_VIC_CHANNELS_MASK;

    /* Set all interrupt sources to map to IRQ */
    g_vic_mmio_registers_p->reg_VICIntSelect = ~ALL_VIC_CHANNELS_MASK;

    /* Initialize all VectAddr0..31 registers to point to dummy interrupt handlers */
    for (i = 0; i < SOC_NUM_INTERRUPT_CHANNELS; i ++)
    {
         g_vic_mmio_registers_p->reg_VICVectAddr[i] = g_dummy_isr_functions[i];

         /*
          * Ensure that the VIC priority for each interrupt channel is the
          * lowest by default
          */
         g_vic_mmio_registers_p->reg_VICVectPriority[i] = VIC_VECT_PRIORITY_LOWEST;
    }

    /* Unmask all priority levels */
    g_vic_mmio_registers_p->reg_VICSWPriorityMask = ALL_VIC_PRIORITIES_MASK;

    /* Configure VIC register access mode
     *
     * NOTE: This is a one-bit register and we are not supposed to read
     * bits 1 to 31, which are reserved
     */
    g_vic_mmio_registers_p->reg_VICProtection = VIC_ACCESS_MASK;

    /*
     * Restore previous interrupt masking in the ARM core
     */
    rtos_k_restore_cpu_interrupts(cpu_status_register);
}


/** 
 * Install an ISR into the VIC
 */
void
install_isr(
        interrupt_channel_t channel,
        isr_function_t *interruptServiceRoutine,
        interrupt_prio_t priority,
        cpu_id_t cpu_id)
{
    FDC_ASSERT(channel < SOC_NUM_INTERRUPT_CHANNELS,
        channel, SOC_NUM_INTERRUPT_CHANNELS);

    FDC_ASSERT_VALID_FUNCTION_POINTER(interruptServiceRoutine);

    FDC_ASSERT(priority < SOC_NUM_INTERRUPT_PRIORITIES,
        priority, SOC_NUM_INTERRUPT_PRIORITIES);

    FDC_ASSERT(cpu_id < SOC_NUM_CPU_CORES, cpu_id, 0);

    /*
     * Interrupt channel is currently disabled in the VIC
     */
    FDC_ASSERT_EQUAL(
        g_vic_mmio_registers_p->reg_VICIntEnable & VIC_CHANNEL_MASK(channel),
        0);

    /*
     * Disable interrupts in the ARM core
     */
    cpu_status_register_t cpu_status_register = rtos_k_disable_cpu_interrupts();

    /*
     * Select IRQ interrupt for the given channel:
     * (0 means IRQ, 1 means FIQ)
     */
    g_vic_mmio_registers_p->reg_VICIntSelect &= ~VIC_CHANNEL_MASK(channel);

    /* Install ISR into VICVectAddr# slot */
    g_vic_mmio_registers_p->reg_VICVectAddr[channel] = interruptServiceRoutine;

    /* Set Vector Priorities */
    g_vic_mmio_registers_p->reg_VICVectPriority[channel] = priority;

    /*  
     *  Enable the interrupt channel in the VIC:
     *
     *  NOTE: There is no need to read the VICIntEnable register
     *  before modifying it, as writing 0s has no effect.
     */
    write_32bit_mmio_register(
        &g_vic_mmio_registers_p->reg_VICIntEnable,
        VIC_CHANNEL_MASK(channel));

    /*
     * Restore previous interrupt masking in the ARM core
     */
    rtos_k_restore_cpu_interrupts(cpu_status_register);
}


void
assert_interrupt_source_is_set(interrupt_channel_t interrupt_channel)
{
    FDC_ASSERT(
        interrupt_channel < SOC_NUM_INTERRUPT_CHANNELS,
        interrupt_channel, SOC_NUM_INTERRUPT_CHANNELS);

    FDC_ASSERT_EQUAL(                             
        g_vic_mmio_registers_p->reg_VICIRQStatus & VIC_CHANNEL_MASK(interrupt_channel),
        VIC_CHANNEL_MASK(interrupt_channel)); 
                                                  
    FDC_ASSERT_EQUAL(                             
        g_vic_mmio_registers_p->reg_VICRawIntr & VIC_CHANNEL_MASK(interrupt_channel),
        VIC_CHANNEL_MASK(interrupt_channel)); 
}


/**
 * Notify interrupt controller that processing for the last interrupt received
 * by the calling CPU core has been completed, so that another interrupt of
 * the same priority or lower can be received by this CPU core
 */
void
notify_interrupt_controller_isr_done(interrupt_channel_t interrupt_channel)
{
    DBG_ASSERT(
        interrupt_channel < SOC_NUM_INTERRUPT_CHANNELS,
        interrupt_channel, SOC_NUM_INTERRUPT_CHANNELS);

    write_32bit_mmio_register(        
        &g_vic_mmio_registers_p->reg_VICAddress, 0x0); 
} 


/* 
 * Generate dummy VIC interrupt handler functions
 */
GENERATE_DUMMY_VIC_ISR_FUNCTION(wdt, VIC_CHANNEL_WDT)
GENERATE_DUMMY_VIC_ISR_FUNCTION(softint, VIC_CHANNEL_SOFTINT)
GENERATE_DUMMY_VIC_ISR_FUNCTION(armcore0, VIC_CHANNEL_ARMCORE0)
GENERATE_DUMMY_VIC_ISR_FUNCTION(armcore1, VIC_CHANNEL_ARMCORE1)
GENERATE_DUMMY_VIC_ISR_FUNCTION(timer0, VIC_CHANNEL_TIMER0)
GENERATE_DUMMY_VIC_ISR_FUNCTION(timer1, VIC_CHANNEL_TIMER1)
GENERATE_DUMMY_VIC_ISR_FUNCTION(uart0, VIC_CHANNEL_UART0)
GENERATE_DUMMY_VIC_ISR_FUNCTION(uart1, VIC_CHANNEL_UART1)
GENERATE_DUMMY_VIC_ISR_FUNCTION(pwm0_1, VIC_CHANNEL_PWM0_1)
GENERATE_DUMMY_VIC_ISR_FUNCTION(i2c0, VIC_CHANNEL_I2C0)
GENERATE_DUMMY_VIC_ISR_FUNCTION(spi_ssp0, VIC_CHANNEL_SPI_SSP0)
GENERATE_DUMMY_VIC_ISR_FUNCTION(ssp1, VIC_CHANNEL_SSP1)
GENERATE_DUMMY_VIC_ISR_FUNCTION(pll, VIC_CHANNEL_PLL)
GENERATE_DUMMY_VIC_ISR_FUNCTION(rtc, VIC_CHANNEL_RTC)
GENERATE_DUMMY_VIC_ISR_FUNCTION(eint0, VIC_CHANNEL_EINT0)
GENERATE_DUMMY_VIC_ISR_FUNCTION(eint1, VIC_CHANNEL_EINT1)
GENERATE_DUMMY_VIC_ISR_FUNCTION(eint2, VIC_CHANNEL_EINT2)
GENERATE_DUMMY_VIC_ISR_FUNCTION(eint3, VIC_CHANNEL_EINT3)
GENERATE_DUMMY_VIC_ISR_FUNCTION(ad0, VIC_CHANNEL_AD0)
GENERATE_DUMMY_VIC_ISR_FUNCTION(i2c1, VIC_CHANNEL_I2C1)
GENERATE_DUMMY_VIC_ISR_FUNCTION(bod, VIC_CHANNEL_BOD)
GENERATE_DUMMY_VIC_ISR_FUNCTION(ethernet, VIC_CHANNEL_ETHERNET)
GENERATE_DUMMY_VIC_ISR_FUNCTION(usb, VIC_CHANNEL_USB)
GENERATE_DUMMY_VIC_ISR_FUNCTION(can, VIC_CHANNEL_CAN)
GENERATE_DUMMY_VIC_ISR_FUNCTION(sd_mmc, VIC_CHANNEL_SD_MMC)
GENERATE_DUMMY_VIC_ISR_FUNCTION(gpdma, VIC_CHANNEL_GPDMA)
GENERATE_DUMMY_VIC_ISR_FUNCTION(timer2, VIC_CHANNEL_TIMER2)
GENERATE_DUMMY_VIC_ISR_FUNCTION(timer3, VIC_CHANNEL_TIMER3)
GENERATE_DUMMY_VIC_ISR_FUNCTION(uart2, VIC_CHANNEL_UART2)
GENERATE_DUMMY_VIC_ISR_FUNCTION(uart3, VIC_CHANNEL_UART3)
GENERATE_DUMMY_VIC_ISR_FUNCTION(i2c2, VIC_CHANNEL_I2C2)
GENERATE_DUMMY_VIC_ISR_FUNCTION(i2s, VIC_CHANNEL_I2S)


/* This macro turns periods in CCLKs */
#define P2C(sdram_period_ns,emc_period_ps)      ((( (sdram_period_ns*1000) < emc_period_ps)? \
                                        0:(uint32_t)((sdram_period_ns*1000)/emc_period_ps))+1)

#define SDRAM_TRRD          15      // Row active to row active delay (min)
#define SDRAM_TRCD          20      //  RAS# to CAS# delay (min)
#define SDRAM_TRP           20      // Row Precharge time (min)
#define SDRAM_TRAS          45      // Row active time (max)
#define SDRAM_TRAS_MAX      100000  //  Row active time (max)
#define SDRAM_TRC           65      // Row cycle time (min)
#define SDRAM_TRFC          65      // tRC=tRFC (min)
#define SDRAM_TRDL_CLK      2       //  Last data in to row precharge (min)
#define SDRAM_TWR_CLK       2       // tRDL=tWR (min)
#define SDRAM_TDAL_CLK      2       // Last data in to Active delay (min)
#define SDRAM_TCDL_CLK      1       //  Last data in to new col address delay (min)
#define SDRAM_TBDL_CLK      1       //  Last data in to burst stop (min)
#define SDRAM_TCCD_CLK      1       //  Col address to col address delay (min)

#define SDRAM_REFRESH       7813
#define SDRAM_TAPR_CLK      1       // Last data out to active command time
#define SDRAM_TXSR          67      // tSREX=tSXR Self-refresh exit time
#define SDRAM_TMRD_CLK      3       // Load mode register to active command time


#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-variable"
static void initSDRAM(uint32_t cclk)
{
    FDC_ASSERT_EQUAL(g_pin_connect_block, PINCON_BASE_ADDR);

    /* Reference: AN10771 Using the LPC24xx EMC peripheral to drive SDRAM
     *
     * Step 1: Configure the EMC Pin function and Pin mode
     * preserving the other bits where appropriate
     */
    g_pin_connect_block->reg_PINSEL[5] &=
    (
          PINSEL_CLR_MASK(  0 )  /* P2.16 CAS#    */
        & PINSEL_CLR_MASK(  1 )  /* P2.17 RAS#    */
        & PINSEL_CLR_MASK(  2 )  /* P2.18 CLKOUT0 */
        & PINSEL_CLR_MASK(  4 )  /* P2.20 DYCS0#  */
        & PINSEL_CLR_MASK(  8 )  /* P2.24 CKEOUT0 */
        & PINSEL_CLR_MASK( 12 )  /* P2.28 DQMOUT0 */
        & PINSEL_CLR_MASK( 13 )  /* P2.29 DQMOUT1 */
        & PINSEL_CLR_MASK( 14 )  /* P2.30 DQMOUT2 */
        & PINSEL_CLR_MASK( 15 )  /* P2.31 DQMOUT3 */
    );

    g_pin_connect_block->reg_PINSEL[5] |=
    (
          PINSEL_MASK( PINSEL_ALT_01 , 0 )  /* P2.16 CAS#    */
        | PINSEL_MASK( PINSEL_ALT_01 , 1 )  /* P2.17 RAS#    */
        | PINSEL_MASK( PINSEL_ALT_01 , 2 )  /* P2.18 CLKOUT0 */
        | PINSEL_MASK( PINSEL_ALT_01 , 4 )  /* P2.20 DYCS0#  */
        | PINSEL_MASK( PINSEL_ALT_01 , 8 )  /* P2.24 CKEOUT0 */
        | PINSEL_MASK( PINSEL_ALT_01 ,12 )  /* P2.28 DQMOUT0 */
        | PINSEL_MASK( PINSEL_ALT_01 ,13 )  /* P2.29 DQMOUT1 */
        | PINSEL_MASK( PINSEL_ALT_01 ,14 )  /* P2.30 DQMOUT2 */
        | PINSEL_MASK( PINSEL_ALT_01 ,15 )  /* P2.31 DQMOUT3 */
    );

    g_pin_connect_block->reg_PINMODE[5] &=
    (
          PINSEL_CLR_MASK(  0 )  /* P2.16 CAS#    */
        & PINSEL_CLR_MASK(  1 )  /* P2.17 RAS#    */
        & PINSEL_CLR_MASK(  2 )  /* P2.18 CLKOUT0 */
        & PINSEL_CLR_MASK(  4 )  /* P2.20 DYCS0#  */
        & PINSEL_CLR_MASK(  8 )  /* P2.24 CKEOUT0 */
        & PINSEL_CLR_MASK( 12 )  /* P2.28 DQMOUT0 */
        & PINSEL_CLR_MASK( 13 )  /* P2.29 DQMOUT1 */
        & PINSEL_CLR_MASK( 14 )  /* P2.30 DQMOUT2 */
        & PINSEL_CLR_MASK( 15 )  /* P2.31 DQMOUT3 */
    );

