jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
    g_pin_connect_block->reg_PINMODE[5] |=
    (
          PINSEL_MASK( PINMODE_PULL_NONE , 0 )  /* P2.16 CAS#    */
        | PINSEL_MASK( PINMODE_PULL_NONE , 1 )  /* P2.17 RAS#    */
        | PINSEL_MASK( PINMODE_PULL_NONE , 2 )  /* P2.18 CLKOUT0 */
        | PINSEL_MASK( PINMODE_PULL_NONE , 4 )  /* P2.20 DYCS0#  */
        | PINSEL_MASK( PINMODE_PULL_NONE , 8 )  /* P2.24 CKEOUT0 */
        | PINSEL_MASK( PINMODE_PULL_NONE ,12 )  /* P2.28 DQMOUT0 */
        | PINSEL_MASK( PINMODE_PULL_NONE ,13 )  /* P2.29 DQMOUT1 */
        | PINSEL_MASK( PINMODE_PULL_NONE ,14 )  /* P2.30 DQMOUT2 */
        | PINSEL_MASK( PINMODE_PULL_NONE ,15 )  /* P2.31 DQMOUT3 */
    );

    /* For Port3, it is only the data bus so we can ignore any previous setting */
    g_pin_connect_block->reg_PINSEL[6] =
    (
          PINSEL_MASK( PINSEL_ALT_01 , 0 )  /* P3.0  D0  */
        | PINSEL_MASK( PINSEL_ALT_01 , 1 )  /* P3.1  D1  */
        | PINSEL_MASK( PINSEL_ALT_01 , 2 )  /* P3.2  D2  */
        | PINSEL_MASK( PINSEL_ALT_01 , 3 )  /* P3.3  D3  */
        | PINSEL_MASK( PINSEL_ALT_01 , 4 )  /* P3.4  D4  */
        | PINSEL_MASK( PINSEL_ALT_01 , 5 )  /* P3.5  D5  */
        | PINSEL_MASK( PINSEL_ALT_01 , 6 )  /* P3.6  D6  */
        | PINSEL_MASK( PINSEL_ALT_01 , 7 )  /* P3.7  D7  */
        | PINSEL_MASK( PINSEL_ALT_01 , 8 )  /* P3.8  D8  */
        | PINSEL_MASK( PINSEL_ALT_01 , 9 )  /* P3.9  D9  */
        | PINSEL_MASK( PINSEL_ALT_01 ,10 )  /* P3.10 D10 */
        | PINSEL_MASK( PINSEL_ALT_01 ,11 )  /* P3.11 D11 */
        | PINSEL_MASK( PINSEL_ALT_01 ,12 )  /* P3.12 D12 */
        | PINSEL_MASK( PINSEL_ALT_01 ,13 )  /* P3.13 D13 */
        | PINSEL_MASK( PINSEL_ALT_01 ,14 )  /* P3.14 D14 */
        | PINSEL_MASK( PINSEL_ALT_01 ,15 )  /* P3.15 D15 */
    );

    g_pin_connect_block->reg_PINMODE[6] =
    (
          PINSEL_MASK( PINMODE_PULL_NONE, 0 )  /* P3.0  D0  */
        | PINSEL_MASK( PINMODE_PULL_NONE, 1 )  /* P3.1  D1  */
        | PINSEL_MASK( PINMODE_PULL_NONE, 2 )  /* P3.2  D2  */
        | PINSEL_MASK( PINMODE_PULL_NONE, 3 )  /* P3.3  D3  */
        | PINSEL_MASK( PINMODE_PULL_NONE, 4 )  /* P3.4  D4  */
        | PINSEL_MASK( PINMODE_PULL_NONE, 5 )  /* P3.5  D5  */
        | PINSEL_MASK( PINMODE_PULL_NONE, 6 )  /* P3.6  D6  */
        | PINSEL_MASK( PINMODE_PULL_NONE, 7 )  /* P3.7  D7  */
        | PINSEL_MASK( PINMODE_PULL_NONE, 8 )  /* P3.8  D8  */
        | PINSEL_MASK( PINMODE_PULL_NONE, 9 )  /* P3.9  D9  */
        | PINSEL_MASK( PINMODE_PULL_NONE,10 )  /* P3.10 D10 */
        | PINSEL_MASK( PINMODE_PULL_NONE,11 )  /* P3.11 D11 */
        | PINSEL_MASK( PINMODE_PULL_NONE,12 )  /* P3.12 D12 */
        | PINSEL_MASK( PINMODE_PULL_NONE,13 )  /* P3.13 D13 */
        | PINSEL_MASK( PINMODE_PULL_NONE,14 )  /* P3.14 D14 */
        | PINSEL_MASK( PINMODE_PULL_NONE,15 )  /* P3.15 D15 */
    );

    g_pin_connect_block->reg_PINSEL[7] =
    (
          PINSEL_MASK( PINSEL_ALT_01 , 0 )  /* P3.16 D16 */
        | PINSEL_MASK( PINSEL_ALT_01 , 1 )  /* P3.17 D17 */
        | PINSEL_MASK( PINSEL_ALT_01 , 2 )  /* P3.18 D18 */
        | PINSEL_MASK( PINSEL_ALT_01 , 3 )  /* P3.19 D19 */
        | PINSEL_MASK( PINSEL_ALT_01 , 4 )  /* P3.20 D20 */
        | PINSEL_MASK( PINSEL_ALT_01 , 5 )  /* P3.21 D21 */
        | PINSEL_MASK( PINSEL_ALT_01 , 6 )  /* P3.22 D22 */
        | PINSEL_MASK( PINSEL_ALT_01 , 7 )  /* P3.23 D23 */
        | PINSEL_MASK( PINSEL_ALT_01 , 8 )  /* P3.24 D24 */
        | PINSEL_MASK( PINSEL_ALT_01 , 9 )  /* P3.25 D25 */
        | PINSEL_MASK( PINSEL_ALT_01 ,10 )  /* P3.26 D26 */
        | PINSEL_MASK( PINSEL_ALT_01 ,11 )  /* P3.27 D27 */
        | PINSEL_MASK( PINSEL_ALT_01 ,12 )  /* P3.28 D28 */
        | PINSEL_MASK( PINSEL_ALT_01 ,13 )  /* P3.29 D29 */
        | PINSEL_MASK( PINSEL_ALT_01 ,14 )  /* P3.30 D30 */
        | PINSEL_MASK( PINSEL_ALT_01 ,15 )  /* P3.31 D31 */
    );

    g_pin_connect_block->reg_PINMODE[7] =
    (
          PINSEL_MASK( PINMODE_PULL_NONE, 0 )  /* P3.16 D16 */
        | PINSEL_MASK( PINMODE_PULL_NONE, 1 )  /* P3.17 D17 */
        | PINSEL_MASK( PINMODE_PULL_NONE, 2 )  /* P3.18 D18 */
        | PINSEL_MASK( PINMODE_PULL_NONE, 3 )  /* P3.19 D19 */
        | PINSEL_MASK( PINMODE_PULL_NONE, 4 )  /* P3.20 D20 */
        | PINSEL_MASK( PINMODE_PULL_NONE, 5 )  /* P3.21 D21 */
        | PINSEL_MASK( PINMODE_PULL_NONE, 6 )  /* P3.22 D22 */
        | PINSEL_MASK( PINMODE_PULL_NONE, 7 )  /* P3.23 D23 */
        | PINSEL_MASK( PINMODE_PULL_NONE, 8 )  /* P3.24 D24 */
        | PINSEL_MASK( PINMODE_PULL_NONE, 9 )  /* P3.25 D25 */
        | PINSEL_MASK( PINMODE_PULL_NONE,10 )  /* P3.26 D26 */
        | PINSEL_MASK( PINMODE_PULL_NONE,11 )  /* P3.27 D27 */
        | PINSEL_MASK( PINMODE_PULL_NONE,12 )  /* P3.28 D28 */
        | PINSEL_MASK( PINMODE_PULL_NONE,13 )  /* P3.29 D29 */
        | PINSEL_MASK( PINMODE_PULL_NONE,14 )  /* P3.30 D30 */
        | PINSEL_MASK( PINMODE_PULL_NONE,15 )  /* P3.31 D31 */
    );

    g_pin_connect_block->reg_PINSEL[8] &=
    (
          PINSEL_CLR_MASK(  0 )  /* P4.0  A0  */
        & PINSEL_CLR_MASK(  1 )  /* P4.1  A1  */
        & PINSEL_CLR_MASK(  2 )  /* P4.2  A2  */
        & PINSEL_CLR_MASK(  3 )  /* P4.3  A3  */
        & PINSEL_CLR_MASK(  4 )  /* P4.4  A4  */
        & PINSEL_CLR_MASK(  5 )  /* P4.5  A5  */
        & PINSEL_CLR_MASK(  6 )  /* P4.6  A6  */
        & PINSEL_CLR_MASK(  7 )  /* P4.7  A7  */
        & PINSEL_CLR_MASK(  8 )  /* P4.8  A8  */
        & PINSEL_CLR_MASK(  9 )  /* P4.9  A9  */
        & PINSEL_CLR_MASK( 10 )  /* P4.10 A10 */
        & PINSEL_CLR_MASK( 11 )  /* P4.11 A11 */
        & PINSEL_CLR_MASK( 12 )  /* P4.12 A12 */
        & PINSEL_CLR_MASK( 13 )  /* P4.13 A13 */
        & PINSEL_CLR_MASK( 14 )  /* P4.14 A14 */
    );

    g_pin_connect_block->reg_PINSEL[8] |=
    (
          PINSEL_MASK( PINSEL_ALT_01 , 0 )  /* P4.0  A0  */
        | PINSEL_MASK( PINSEL_ALT_01 , 1 )  /* P4.1  A1  */
        | PINSEL_MASK( PINSEL_ALT_01 , 2 )  /* P4.2  A2  */
        | PINSEL_MASK( PINSEL_ALT_01 , 3 )  /* P4.3  A3  */
        | PINSEL_MASK( PINSEL_ALT_01 , 4 )  /* P4.4  A4  */
        | PINSEL_MASK( PINSEL_ALT_01 , 5 )  /* P4.5  A5  */
        | PINSEL_MASK( PINSEL_ALT_01 , 6 )  /* P4.6  A6  */
        | PINSEL_MASK( PINSEL_ALT_01 , 7 )  /* P4.7  A7  */
        | PINSEL_MASK( PINSEL_ALT_01 , 8 )  /* P4.8  A8  */
        | PINSEL_MASK( PINSEL_ALT_01 , 9 )  /* P4.9  A9  */
        | PINSEL_MASK( PINSEL_ALT_01 ,10 )  /* P4.10 A10 */
        | PINSEL_MASK( PINSEL_ALT_01 ,11 )  /* P4.11 A11 */
        | PINSEL_MASK( PINSEL_ALT_01 ,12 )  /* P4.12 A12 */
        | PINSEL_MASK( PINSEL_ALT_01 ,13 )  /* P4.13 A13 */
        | PINSEL_MASK( PINSEL_ALT_01 ,14 )  /* P4.14 A14 */
    );

    g_pin_connect_block->reg_PINMODE[8] &=
    (
          PINSEL_CLR_MASK(  0 )  /* P4.0  A0  */
        & PINSEL_CLR_MASK(  1 )  /* P4.1  A1  */
        & PINSEL_CLR_MASK(  2 )  /* P4.2  A2  */
        & PINSEL_CLR_MASK(  3 )  /* P4.3  A3  */
        & PINSEL_CLR_MASK(  4 )  /* P4.4  A4  */
        & PINSEL_CLR_MASK(  5 )  /* P4.5  A5  */
        & PINSEL_CLR_MASK(  6 )  /* P4.6  A6  */
        & PINSEL_CLR_MASK(  7 )  /* P4.7  A7  */
        & PINSEL_CLR_MASK(  8 )  /* P4.8  A8  */
        & PINSEL_CLR_MASK(  9 )  /* P4.9  A9  */
        & PINSEL_CLR_MASK( 10 )  /* P4.10 A10 */
        & PINSEL_CLR_MASK( 11 )  /* P4.11 A11 */
        & PINSEL_CLR_MASK( 12 )  /* P4.12 A12 */
        & PINSEL_CLR_MASK( 13 )  /* P4.13 A13 */
        & PINSEL_CLR_MASK( 14 )  /* P4.14 A14 */
    );

    g_pin_connect_block->reg_PINMODE[8] |=
    (
          PINSEL_MASK( PINMODE_PULL_NONE, 0 )  /* P4.0  A0  */
        | PINSEL_MASK( PINMODE_PULL_NONE, 1 )  /* P4.1  A1  */
        | PINSEL_MASK( PINMODE_PULL_NONE, 2 )  /* P4.2  A2  */
        | PINSEL_MASK( PINMODE_PULL_NONE, 3 )  /* P4.3  A3  */
        | PINSEL_MASK( PINMODE_PULL_NONE, 4 )  /* P4.4  A4  */
        | PINSEL_MASK( PINMODE_PULL_NONE, 5 )  /* P4.5  A5  */
        | PINSEL_MASK( PINMODE_PULL_NONE, 6 )  /* P4.6  A6  */
        | PINSEL_MASK( PINMODE_PULL_NONE, 7 )  /* P4.7  A7  */
        | PINSEL_MASK( PINMODE_PULL_NONE, 8 )  /* P4.8  A8  */
        | PINSEL_MASK( PINMODE_PULL_NONE, 9 )  /* P4.9  A9  */
        | PINSEL_MASK( PINMODE_PULL_NONE,10 )  /* P4.10 A10 */
        | PINSEL_MASK( PINMODE_PULL_NONE,11 )  /* P4.11 A11 */
        | PINSEL_MASK( PINMODE_PULL_NONE,12 )  /* P4.12 A12 */
        | PINSEL_MASK( PINMODE_PULL_NONE,13 )  /* P4.13 A13 */
        | PINSEL_MASK( PINMODE_PULL_NONE,14 )  /* P4.14 A14 */
    );

    g_pin_connect_block->reg_PINSEL[9] &=
    (
          PINSEL_CLR_MASK( 9 )  /* P4.25 WE# */
    );

