jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
    g_pin_connect_block->reg_PINSEL[9] |=
    (
          PINSEL_MASK( PINSEL_ALT_01 , 9 )  /* P4.25 WE# */
    );

    g_pin_connect_block->reg_PINMODE[9] &=
    (
          PINSEL_CLR_MASK( 9 ) /* P4.25 WE# */
    );

    g_pin_connect_block->reg_PINMODE[9] |=
    (
          PINSEL_MASK( PINMODE_PULL_NONE, 9 ) /* P4.25 WE# */
    );

    /*
     * Step 2: enable EMC and set EMC parameters
     */

    /* Turn on EMC power in the System Control Block */
    turn_on_power(PCONP_PCEMC);

    /* enable EMC */
    g_emc_mmio_registers_p->reg_CONTROL = EMCCONTROL_ENABLE;

    /* Configure the dynamic memory read strategy (Command delayed strategy) */
    g_emc_mmio_registers_p->reg_DYNAMICREADCONFIG = EMCDYNAMICREADCONFIG_RD_CMDDELAY;

    /* CAS latency = 3, RAS latency (active to read/write delay) = 3 */
    // TODO extra credit: is this or'd or blow away?
    g_emc_mmio_registers_p->dynamic_config[0].reg_DYNAMICRASCAS =
        EMCDYNAMICRASCAS_CAS3 | EMCDYNAMICRASCAS_RAS3;

    /* calc SDRAM period in pico-seconds) */
    uint32_t emc_period_ps = 1000000/(cclk/1000000);

    g_emc_mmio_registers_p->reg_DYNAMICRP   = P2C(SDRAM_TRP,emc_period_ps);
    g_emc_mmio_registers_p->reg_DYNAMICRAS  = P2C(SDRAM_TRAS,emc_period_ps);
    g_emc_mmio_registers_p->reg_DYNAMICSREX = P2C(SDRAM_TXSR,emc_period_ps);
    g_emc_mmio_registers_p->reg_DYNAMICAPR  = SDRAM_TAPR_CLK;
    g_emc_mmio_registers_p->reg_DYNAMICDAL  = SDRAM_TDAL_CLK+P2C(SDRAM_TRP,emc_period_ps);
    g_emc_mmio_registers_p->reg_DYNAMICWR   = SDRAM_TWR_CLK;
    g_emc_mmio_registers_p->reg_DYNAMICRC   = P2C(SDRAM_TRC,emc_period_ps);
    g_emc_mmio_registers_p->reg_DYNAMICRFC  = P2C(SDRAM_TRFC,emc_period_ps);
    g_emc_mmio_registers_p->reg_DYNAMICXSR  = P2C(SDRAM_TXSR,emc_period_ps);
    g_emc_mmio_registers_p->reg_DYNAMICRRD  = P2C(SDRAM_TRRD,emc_period_ps);
    g_emc_mmio_registers_p->reg_DYNAMICMRD  = SDRAM_TMRD_CLK;

    /* 32-bit external bus high-performance address mapping
     *  256 Mb (16Mx16bit), 4 banks, row length = 13, column length = 9 */
    g_emc_mmio_registers_p->dynamic_config[0].reg_DYNAMICCONFIG =
        EMCDYNAMICCONFIG_AM_32BIT_HP_256MB_4BANKS_R13_C9;

    /* Step 3: perform SDRAM initialization
     * JEDEC General SDRAM Initialization Sequence
       Delay to allow power and clocks to stabilize ~100 us
     */

    /* Issue SDRAM NOP (no operation) command,
     * CLKOUT runs continuously,
     * all clock enables are driven HIGH continuously */
    g_emc_mmio_registers_p->reg_DYNAMICCONTROL = EMCDYNAMICCONTROL_I_NOP | EMCDYNAMICCONTROL_CS | EMCDYNAMICCONTROL_CE; // 0x0183

    volatile uint32_t i;
    for(i = 200*30; i;i--);

    /* Issue SDRAM PALL (precharge all) command */
    g_emc_mmio_registers_p->reg_DYNAMICCONTROL = (g_emc_mmio_registers_p->reg_DYNAMICCONTROL & ~EMCDYNAMICCONTROL_I_MASK) | EMCDYNAMICCONTROL_I_PALL;

    /* n x 16 CCLKs between SDRAM refresh cycles */
    g_emc_mmio_registers_p->reg_DYNAMICREFRESH = 1; // n=1; 1x16 CCLKs between SDRAM refresh cycles

    for(i= 128; i; --i); // > 128 clk

    /* Calculate and configure SDRAM refresh time based on CCLK
     * must divide by 16 since the value is multiplied by 16 (n x 16 CCLKs)
     */
    g_emc_mmio_registers_p->reg_DYNAMICREFRESH = P2C(SDRAM_REFRESH,emc_period_ps) >> 4;

    /* Issue SDRAM Mode Command */
    g_emc_mmio_registers_p->reg_DYNAMICCONTROL =
        (g_emc_mmio_registers_p->reg_DYNAMICCONTROL & ~EMCDYNAMICCONTROL_I_MASK) |
        EMCDYNAMICCONTROL_I_MODE;

    //TODO extra credit: remove, what is this?
    //Burst 8, Sequential, CAS 2
    //volatile uint32_t Dummy = *(volatile unsigned short *)
    //                                ((uint32_t)&SDRAM_BASE + (0x33UL << (12)));

    //SHIFT_HIGH_PERFORMANCE = COL + TBW + BANK, where
    //COL=# of column bits (here: 9)
    //TBW=total bus width, 1=16 bits, 2=32 bits (here: 2)
    //BANK=# of bank select bits (here: 2)
    // --Formula courtesy of Rolf Meeser
    // Burst 4, Sequential, CAS-3

    /*
     * This is necessary for the LCD to work properly, since we will be
     * placing the LCD frame buffer in SDRAM.
     */
    volatile uint32_t Dummy = *(volatile uint32_t *)
                                    ((uint32_t)BOARD_SDRAM_BASE + (0x32UL << (13)));

    /* Issue SDRAM normal command, CLKOUT enabled, CLKOUT stop, all clock enables low */
    g_emc_mmio_registers_p->reg_DYNAMICCONTROL = 0x00000000;

    /* Buffer enabled for accesses to DCS0 chip */
    g_emc_mmio_registers_p->dynamic_config[0].reg_DYNAMICCONFIG |= EMCDYNAMICCONFIG_BUFFER_ENABLE;

    delay_loop(10000);
}
#pragma GCC diagnostic pop


static void disableSDRAM(void)
{
    /* Step 1: perform SDRAM disabled mode */

    /* Issue
     * SR=1: Enter self-refresh mode (POR reset value)
     */
    if(!(g_emc_mmio_registers_p->reg_STATUS & EMCSTATUS_SA))
    {
      g_emc_mmio_registers_p->reg_DYNAMICCONTROL = EMCDYNAMICCONTROL_SR;
    }

    /* Wait until Self-Refresh Acknowledged */
    while(!(g_emc_mmio_registers_p->reg_STATUS & EMCSTATUS_SA));

}


static uint32_t
get_peripheral_clock_freq(
    uint32_t peripheral_clock_selector_index,
    uint32_t peripheral_clock_shift)
{
    uint8_t peripheral_clock_divider;
    uint8_t peripheral_clock_selector;
    uint32_t cpu_clock_freq;
    fdc_error_t fdc_error;

    peripheral_clock_selector =
        GET_PCLK_SEL(
            g_scb_mmio_registers_p->reg_PCLKSEL[peripheral_clock_selector_index],
            peripheral_clock_shift);

    switch (peripheral_clock_selector)
    {
    case 0:
        peripheral_clock_divider = 4;
        break;

    case 1:
        peripheral_clock_divider = 1;
        break;

    case 2:
        peripheral_clock_divider = 2;
        break;

    case 3:
        peripheral_clock_divider = 8;
        break;

    default:
        fdc_error = CAPTURE_FDC_ERROR(
            "Invalid peripheral_clock_selector", peripheral_clock_selector, 0);
        fatal_error_handler(fdc_error);
    }

    cpu_clock_freq = getFcclk();
    return cpu_clock_freq / peripheral_clock_divider;
}


static void
init_timer(
    const struct timer_device *timer_device_p,
    uint32_t timer_frequency_hz,
    bool generate_interrupts
    )
{
    uint32_t prescale;
    uint32_t reg_value;
    lpc2478_timer_t *timer_mmio_registers_p = timer_device_p->tmr_mmio_registers_p;
    uint32_t timer_pclk_shift = timer_device_p->tmr_timer_pclk_shift;
    uint32_t timer_pclksel_index = timer_device_p->tmr_pclksel_index;
    vic_interrupt_channel_t vic_channel = 
        timer_device_p->tmr_rtos_interrupt_params.irp_channel;

    turn_on_power(timer_device_p->tmr_pconp_mask);

