jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
    /*
     * Disable interrupts in the ARM core
     */
    cpu_status_register_t cpu_status_register = rtos_k_disable_cpu_interrupts();

#if 0 // XXX Remove this code
    /*  
     *  Disable timer interrupt in the VIC
     *
     *  NOTE: There is no need to read the VICIntEnClear register
     *  before modifying it, as writing 0s has no effect.
     */
    g_vic_mmio_registers_p->reg_VICIntEnClear = VIC_CHANNEL_MASK(vic_channel);
#endif

    uint32_t timer_pclksel_freq =
        get_peripheral_clock_freq(timer_pclksel_index, timer_pclk_shift);
    
    FDC_ASSERT(timer_pclksel_freq != 0, 0, 0);

    /*
     * Determine prescale amount:
     *
     * NOTE: we calculate the largest prescale, so that we can set MR0
     * to the smallest non-zero value: 1, to save a little power by having
     * the timer circuits switch fewer times.
     *
     * For example, if the timer peripheral clock frequency is 72 MHz,
     * timer_frequency_hz is 100 and TARGET_NUM_TC_INCREMENTS is 2, then
     * prescale would be:
     * 
     *      (72,000,000 / 100) / 2 = 360,000
     */
    prescale = (timer_pclksel_freq / timer_frequency_hz) / TARGET_NUM_TC_INCREMENTS;

    if (prescale == 0)
    {
        /*
         * The minimum prescale value is 1
         */
        prescale = 1;
    }

    /*
     * Program the Timer registers.
     * make sure we are not running at half the speed due to the way the
     * counters increment and match
     */

    /*
     * Disable and reset Timer and Prescale counters
     */
    reg_value = timer_mmio_registers_p->reg_TCR;
    CLEAR_BIT_FIELD(reg_value, TCR_RESERVED_MASK);
    reg_value &= ~TCR_COUNTER_ENABLE_MASK;
    reg_value |= TCR_COUNTER_RESET_MASK;
    timer_mmio_registers_p->reg_TCR = reg_value;

    /*
     * Set the Prescale register (PR)
     *
     * NOTE: We use prescale - 1 because the first time that reg_PC is
     * incremented, it is actually set to 0, not to 1. So the count 
     * kept in reg_PC is one unit behind.
     */
    
    FDC_ASSERT(prescale >= 1, prescale, 0);

    timer_mmio_registers_p->reg_PR = prescale - 1;

    /*
     * Set the timer/counter mode to Timer Mode. The prescale counter
     * register (PC) will get incremented on every rising PCLK edge, 
     * until it matches the PR register. On the next PCLK cycle after
     * reg_PC matches reg_PR, reg_PC is reset back to 0 and reg_TC is
     * incremented. Note also that the first time that reg_TC is
     * incremented, it is actually set to 0, not 1.
     */
    reg_value = timer_mmio_registers_p->reg_CTCR;
    reg_value &= ~CTCR_COUNTER_TIMER_MODE_MASK;
    reg_value |= CTCR_TIMER_MODE;
    timer_mmio_registers_p->reg_CTCR = reg_value;

    if (generate_interrupts)
    {
        /*
         * Set the value of the MR0 register and configure generation of periodic
         * interrupts for the timer when the TC register matches the value in MR0,
         * and disable all the other control functions in the MCR register
         *
         * NOTE: We use TARGET_NUM_TC_INCREMENTS - 1 because the first time that
         * reg_TC is incremented, it is actually set to 0, not to 1. So the count
         * kept in reg_TC is one unit behind.
         */
        timer_mmio_registers_p->reg_MR[0] = TARGET_NUM_TC_INCREMENTS - 1;
        timer_mmio_registers_p->reg_MCR = MCR_MR0I_MASK | MCR_MR0R_MASK;

        /*
         * Clear any old interrupt asserted by the peripheral by writing a logic one to the
         * corresponding IR bit
         */
        timer_mmio_registers_p->reg_IR |= IR_MR0_INTERRUPT_MASK;

#if 0 // XXX Remove this code
        /*  
         *  Enable the corresponding timer interrupt channel in the VIC
         *
         *  NOTE: There is no need to read the VICIntEnable register
         *  before modifying it, as writing 0s has no effect.
         */
        g_vic_mmio_registers_p->reg_VICIntEnable = VIC_CHANNEL_MASK(vic_channel);
#endif //XXX

        /*
         * Enable Timer and Prescale counters so that interrupts start coming
         */
        reg_value = timer_mmio_registers_p->reg_TCR;
        reg_value &= ~TCR_COUNTER_RESET_MASK;
        reg_value |= TCR_COUNTER_ENABLE_MASK; 
        timer_mmio_registers_p->reg_TCR = reg_value;
    }
    else
    {
        /*
         * This timer is just used as a running counter. The 32-bit Timer
         * Counter register is incremented when the prescale counter reaches
         * its terminal count. The current counter value can be read from
         * register timer_mmio_registers_p->reg_TC.
         */
        reg_value = timer_mmio_registers_p->reg_TCR;
        CLEAR_BIT_FIELD(reg_value, TCR_RESERVED_MASK);
        reg_value &= ~TCR_COUNTER_RESET_MASK;
        reg_value |= TCR_COUNTER_ENABLE_MASK; 
        timer_mmio_registers_p->reg_TCR = reg_value;
    }

    /*
     * Restore previous interrupt masking in the ARM core
     */
    rtos_k_restore_cpu_interrupts(cpu_status_register);
}


void
clear_timer_interrupt_source(
    _IN_ const struct timer_device *timer_device_p)
{
    DBG_ASSERT_CPU_INTERRUPTS_DISABLED();
    DBG_ASSERT(
        timer_device_p->tmr_signature == TIMER_DEVICE_SIGNATURE,
        timer_device_p->tmr_signature, timer_device_p);

    lpc2478_timer_t *timer_mmio_registers_p = timer_device_p->tmr_mmio_registers_p;
    vic_interrupt_channel_t vic_channel = 
        timer_device_p->tmr_rtos_interrupt_params.irp_channel;

    FDC_ASSERT_INTERRUPT_SOURCE_IS_SET(vic_channel);

    FDC_ASSERT_EQUAL(                             
        timer_mmio_registers_p->reg_IR & IR_MR0_INTERRUPT_MASK,
        IR_MR0_INTERRUPT_MASK); 

    /*
     * Clear interrupt condition in the timer device by writing a logic one to the
     * corresponding IR bit
     */
    timer_mmio_registers_p->reg_IR |= IR_MR0_INTERRUPT_MASK;

    FDC_ASSERT_EQUAL(                             
        g_vic_mmio_registers_p->reg_VICRawIntr & VIC_CHANNEL_MASK(vic_channel),
        0); 
}


void
timer_interrupt_handler(
    _IN_ const struct timer_device *timer_device_p)
{
    struct rtos_interrupt *timer_interrupt_p =
        *timer_device_p->tmr_rtos_interrupt_pp;

    FDC_ASSERT_RTOS_INTERRUPT_HANDLER_PRECONDITIONS(timer_interrupt_p);
    rtos_tick_timer_interrupt_handler(timer_interrupt_p);
}


static inline void
uart_putchar_internal(
    _IN_ const struct uart_device *uart_device_p, 
    _IN_ uint8_t c,
    _IN_ bool use_condvar)
{
    struct uart_device_var *const uart_var_p = uart_device_p->urt_var_p;
    lpc2478_uart_t *const uart_mmio_registers_p = uart_device_p->urt_mmio_uart_p;
    uint8_t reg_lsr_value;

    if (!uart_var_p->urt_initialized)
    {
        /*
         * Any call to this function from a "printf()" placed before the
         * serial port gets initialized has to be ignored.
         *
         * We can't call FDC_ASSERT or CAPTURE_APP_ERROR() here as that can
         * cause an infinite recursion, because they call this function
         * from FAILURE_PRINTF().
         */
        return;
    }

