jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
    for ( ; ; )
    {
        reg_lsr_value = read_8bit_mmio_register(&uart_mmio_registers_p->reg_LSR);
        if ((reg_lsr_value & UART_LSR_THRE_MASK) != 0)
        {
            break;
        }

        if (use_condvar)
        {
            rtos_k_condvar_wait_interrupt(&uart_var_p->urt_thre_condvar);
        }
    }

    write_8bit_mmio_register(&uart_mmio_registers_p->reg_THR, c);
}


/**
 * Send a character over a UART serial port, blocking the caller on a condvar
 * if the UART Tx fifo is full.
 */
void
uart_putchar(
    _IN_ const struct uart_device *uart_device_p, 
    _IN_ uint8_t c)
{
    uart_putchar_internal(uart_device_p, c, true);
}


/**
 * Send a character over a UART serial port, doing polling until the UART Tx
 * fifo is not full. This is inefficient and should only be used only for
 * sending failure data on the serial port.
 */
void
uart_putchar_with_polling(
    _IN_ const struct uart_device *uart_device_p, 
    _IN_ uint8_t c)
{
    uart_putchar_internal(uart_device_p, c, false);
}


/**
 * Receive a character from a UART serial port
 */
uint8_t
uart_getchar(
    _IN_ const struct uart_device *uart_device_p)
{
    struct uart_device_var *const uart_var_p = uart_device_p->urt_var_p;
    lpc2478_uart_t *const uart_mmio_registers_p = uart_device_p->urt_mmio_uart_p;
    uint8_t reg_lsr_value;
    uint8_t char_received;

    FDC_ASSERT(
        uart_var_p->urt_initialized, uart_var_p, uart_device_p);

    reg_lsr_value = read_8bit_mmio_register(&uart_mmio_registers_p->reg_LSR);
    if (reg_lsr_value & UART_LSR_RDR_MASK)
    {
        char_received =
            read_8bit_mmio_register(&uart_mmio_registers_p->reg_RBR);
    }
    else
    {
        /*
         * Disable interrupts in the ARM core
         */
        cpu_status_register_t cpu_status_register = rtos_k_disable_cpu_interrupts();

        /*
         * Enable or re-enable generation of UART RDA interrupts:
         */
        uint32_t reg_value = read_32bit_mmio_register(&uart_mmio_registers_p->reg_IER);
        reg_value |= UART_IER_RDA_INTERRUPT_ENABLE_MASK;
        write_32bit_mmio_register(&uart_mmio_registers_p->reg_IER, reg_value);

        /*
         * Wait to be signaled from UART interrupt:
         */
        rtos_k_condvar_wait_interrupt(&uart_var_p->urt_rdr_condvar);

        FDC_ASSERT(uart_var_p->urt_byte_received_pending,
            uart_var_p, 0);

        char_received = uart_var_p->urt_first_byte_received;
        uart_var_p->urt_byte_received_pending = false;

        /*
         * Restore previous interrupt masking in the ARM core
         */
        rtos_k_restore_cpu_interrupts(cpu_status_register);
    }

    return char_received;
}


static void
init_leds(void)
{
    configure_pin(&g_sd_mmc_led_pin, true);
    configure_pin(&g_usb_host_link_led_pin, true);
    configure_pin(&g_usb_device_link_led_pin, true);

    /*
     * Turn off LEDs
     */
    deactivate_output_pin(&g_sd_mmc_led_pin);
    deactivate_output_pin(&g_usb_host_link_led_pin);
    deactivate_output_pin(&g_usb_device_link_led_pin);
}


static inline void
toggle_led(const struct pin_config_info *pin_info_p, bool *led_is_on_p)
{
    if (*led_is_on_p)
    {
        /*
         * Turn led off
         */
        deactivate_output_pin(pin_info_p);
    }
    else
    {
        /*
         * Turn led on
         */
        activate_output_pin(pin_info_p);
    }

    *led_is_on_p ^= true;
}


void
toggle_heartbeat_led(void)
{
    static bool led_is_on = false;

    toggle_led(&g_sd_mmc_led_pin, &led_is_on);
}


void
toggle_usb_host_link_led(void)
{
    static bool led_is_on = false;

    toggle_led(&g_usb_host_link_led_pin, &led_is_on);
}


void
toggle_usb_device_link_led(void)
{
    static bool led_is_on = false;

    toggle_led(&g_usb_device_link_led_pin, &led_is_on);
}


void
init_buttons(const struct buttons_device *buttons_device_p)
{
    FDC_ASSERT(
        buttons_device_p->bd_signature == BUTTONS_DEVICE_SIGNATURE,
        buttons_device_p->bd_signature, BUTTONS_DEVICE_SIGNATURE);

    cpu_id_t cpu_id = SOC_GET_CURRENT_CPU_ID();

    volatile struct gpio_port_interrupt_registers
        *gpio_port_mmio_interrupt_registers_p =
            buttons_device_p->bd_gpio_port_mmio_interrupt_registers_p;

    rtos_k_condvar_init(
        buttons_device_p->bd_condvar_name_p,
        cpu_id,
        &buttons_device_p->bd_var_p->bd_condvar);

    configure_pin(&buttons_device_p->bd_button1_pin, false);
    configure_pin(&buttons_device_p->bd_button2_pin, false);

#ifdef USE_GPIO_INTERRUPTS // a storm of EINT3 interrupts is generated.
                           // Not clear yet to fix this.
    /*
     * Clear interrupt source, before installing ISR:
     */

    write_32bit_mmio_register(
        &gpio_port_mmio_interrupt_registers_p->reg_IntClr,
        BUTTON1_PIN_MASK | BUTTON2_PIN_MASK);

    /*
     * Install ISR:
     */
    rtos_k_register_interrupt(
        &buttons_device_p->bd_rtos_interrupt_params,
        buttons_device_p->bd_rtos_interrupt_pp);

    DBG_ASSERT(
        *buttons_device_p->bd_rtos_interrupt_pp, buttons_device_p, 0);

    /*
     * Enable generation of interrupts for port GPIO_PORT_P2,
     * for detecting falling edge on pins BUTTON1_PIN_BIT_INDEX
     * and BUTTON2_PIN_BIT_INDEX:
     */

    uint32_t reg_value = read_32bit_mmio_register(
        &gpio_port_mmio_interrupt_registers_p->reg_IntEnF);

    reg_value |= (BUTTON1_PIN_MASK | BUTTON2_PIN_MASK);

    write_32bit_mmio_register(
        &gpio_port_mmio_interrupt_registers_p->reg_IntEnF, reg_value);
#endif
}


/**
 * Clear last GPIO ports interrupt
 */ 
void
clear_gpio_ports_interrupt_source(
    const struct buttons_device *buttons_device_p)
{
    DBG_ASSERT_CPU_INTERRUPTS_DISABLED();
    DBG_ASSERT(
        buttons_device_p->bd_signature == BUTTONS_DEVICE_SIGNATURE,
        buttons_device_p->bd_signature, buttons_device_p);

