jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
    uint32_t reg_value;
    struct buttons_device_var *buttons_device_var_p =
        buttons_device_p->bd_var_p;

    volatile struct gpio_interrupt_registers
        *gpio_mmio_interrupt_registers_p =
            buttons_device_p->bd_gpio_mmio_interrupt_registers_p;

    volatile struct gpio_port_interrupt_registers
        *gpio_port_mmio_interrupt_registers_p =
            buttons_device_p->bd_gpio_port_mmio_interrupt_registers_p;

    reg_value = read_32bit_mmio_register(
                    &gpio_mmio_interrupt_registers_p->reg_IntStatus);

#if 0    
    FDC_ASSERT(
        reg_value & GPIO_INT_STATUS_P2_INT_MASK,
        reg_value, 0);
#endif
    
    reg_value = read_32bit_mmio_register(
                    &gpio_port_mmio_interrupt_registers_p->reg_IntStatF);

    uint32_t buttons_pressed = 0x0;

    if (reg_value & BUTTON1_PIN_MASK)
    {
        buttons_pressed |= BUTTON1_PRESSED_MASK;
    }

    if (reg_value & BUTTON2_PIN_MASK)
    {
        buttons_pressed |= BUTTON2_PRESSED_MASK;
    }

#if 0
    FDC_ASSERT(
        buttons_pressed != 0x0, buttons_device_p, 0);
#endif

    buttons_device_var_p->bd_buttons_pressed_bitmap = buttons_pressed;

    /*
     * Clear interrupt source:
     */
    write_32bit_mmio_register(
        &gpio_port_mmio_interrupt_registers_p->reg_IntClr, reg_value);

    /*
     * We cannot receive further interrupts of this type until read_buttons() gets
     * a chance to process the state of the buttons. So, here we just disable
     * the corresponding VIC channel, so that we don't get interrupted again
     * for this interrupt that are leaving pending.
     */
    write_32bit_mmio_register(
        &g_vic_mmio_registers_p->reg_VICIntEnClear,
        VIC_CHANNEL_MASK(buttons_device_p->bd_rtos_interrupt_params.irp_channel));
}


/**
 * GPIO ports interrupt handler
 */
void
gpio_ports_interrupt_handler(
    const struct buttons_device *buttons_device_p)
{
    DBG_ASSERT(
        buttons_device_p->bd_signature == BUTTONS_DEVICE_SIGNATURE,
        buttons_device_p->bd_signature, buttons_device_p);
   
    struct rtos_interrupt *buttons_interrupt_p =
        *buttons_device_p->bd_rtos_interrupt_pp;

    FDC_ASSERT_RTOS_INTERRUPT_HANDLER_PRECONDITIONS(buttons_interrupt_p);

    struct buttons_device_var *buttons_device_var_p =
        buttons_device_p->bd_var_p;

#if 0 // XXX
    DBG_ASSERT(
        buttons_device_var_p->bd_buttons_pressed_bitmap != 0x0,
        buttons_device_var_p, buttons_device_p);
#endif

    rtos_k_condvar_signal(
        &buttons_device_var_p->bd_condvar);
}


/**
 * Read the buttons device. It blocks the calling thread until a button is
 * pressed.
 * 
 * @return  bit map of the buttons last pressed
 */ 
uint32_t
read_buttons(
    _IN_ const struct buttons_device *buttons_device_p)
{
    FDC_ASSERT(
        buttons_device_p->bd_signature == BUTTONS_DEVICE_SIGNATURE,
        buttons_device_p->bd_signature, buttons_device_p);

    uint32_t buttons_pressed_bitmap = 0x0;

#ifdef USE_GPIO_INTERRUPTS
    do {
        /*
         * Wait for a GPIO interrupt on port GPIO_PORT_P2:
         */
        rtos_k_condvar_wait_interrupt(
            &buttons_device_p->bd_var_p->bd_condvar);

        buttons_pressed_bitmap = 
            buttons_device_p->bd_var_p->bd_buttons_pressed_bitmap;

        /*
         * Re-enable the corresponding VIC channel:
         */
        write_32bit_mmio_register(
            &g_vic_mmio_registers_p->reg_VICIntEnable,
            VIC_CHANNEL_MASK(buttons_device_p->bd_rtos_interrupt_params.irp_channel));
    } while (buttons_pressed_bitmap == 0x0);
#else

    volatile struct fast_gpio_port *fast_gpio_port_registers_p =
        &g_fast_gpio_ports_array[buttons_device_p->bd_gpio_port_index];

    uint32_t reg_value =
        read_32bit_mmio_register(&fast_gpio_port_registers_p->reg_FIOPIN);

    if ((reg_value & BUTTON1_PIN_MASK) == 0)
    {
        buttons_pressed_bitmap |= BUTTON1_PRESSED_MASK;
    }

    if ((reg_value & BUTTON2_PIN_MASK) == 0)
    {
        buttons_pressed_bitmap |= BUTTON2_PRESSED_MASK;
    }

#endif

    return buttons_pressed_bitmap;
}


static void
init_adc(const struct adc_device *adc_device_p)
{
    uint32_t reg_value;

    FDC_ASSERT(
        adc_device_p->ad_signature == ADC_DEVICE_SIGNATURE,
        adc_device_p->ad_signature, adc_device_p);

    lpc2478_adc_t *adc_mmio_registers_p = adc_device_p->ad_mmio_registers_p;
    cpu_id_t cpu_id = SOC_GET_CURRENT_CPU_ID();
	
    /*
     * Turn on ADC power in the System Control Block
     */
    turn_on_power(PCONP_PCADC);

    uint32_t adc_pclksel_freq = get_peripheral_clock_freq(0, PCLK_ADC);
    
    FDC_ASSERT(adc_pclksel_freq != 0, 0, 0);

    /*
     *  Calculate value for the ADC clock divider:
     *
     * The APB clock (PCLK) is divided by this value plus one to produce the
     * clock for the A/D converter, which should be less than or equal to 4.5 MHz.
     *
     * adc_pclksel_freq / (adc_clock_divider + 1) = ADC_CLOCK_FREQUENCY
     *
     * So,
     * adc_clock_divider = (adc_pclk_freq / ADC_CLOCK_FREQUENCY) - 1
     */
    uint8_t adc_clock_divider = (adc_pclksel_freq / ADC_CLOCK_FREQUENCY) - 1;
  
    /*
     * Initialize of the AD0CR register:
     */

    reg_value = read_32bit_mmio_register(
                    &adc_mmio_registers_p->reg_AD0CR);

    reg_value &= ~AD0CR_BURST_MASK;
    CLEAR_BIT_FIELD(reg_value, AD0CR_SEL_MASK);
    CLEAR_BIT_FIELD(reg_value, AD0CR_START_MASK);
    SET_BIT_FIELD(reg_value, AD0CR_CLKDIV_MASK, AD0CR_CLKDIV_SHIFT,
                  adc_clock_divider);
    reg_value |= AD0CR_PDN_MASK;

    write_reg_AD0CR(&adc_mmio_registers_p->reg_AD0CR, reg_value);

    for (uint8_t i = 0; i < NUM_ADC_CHANNELS; i ++)
    {
        struct adc_channel *adc_channel_p = &adc_device_p->ad_adc_channels_p[i];

        rtos_k_condvar_init(
            adc_device_p->ad_channel_condvar_names[i],
            cpu_id,
            &adc_channel_p->adc_condvar);

