jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
        adc_channel_p->adc_conversion_completed = false;
    }

    /*
     * Disable interrupts in the ARM core
     */
    cpu_status_register_t cpu_status_register = rtos_k_disable_cpu_interrupts();

    /*
     * Install ISR before enabling interrupt source:
     */
    rtos_k_register_interrupt(
        &adc_device_p->ad_rtos_interrupt_params,
        adc_device_p->ad_rtos_interrupt_pp);

    DBG_ASSERT(
        *adc_device_p->ad_rtos_interrupt_pp != NULL,
        adc_device_p->ad_rtos_interrupt_pp, cpu_id);

    /*
     * Enable a separate interrupt for each A/D channel in the A/D converter:
     */
    write_32bit_mmio_register(
        &adc_mmio_registers_p->reg_AD0INTEN,
        AD0INTEN_ADINTEN_MASK);

    /*
     * Restore previous interrupt masking in the ARM core
     */
    rtos_k_restore_cpu_interrupts(cpu_status_register);
}


/**
 * Clear last interrupt for the given UART
 */ 
void
clear_adc_interrupt_source(
    _IN_ const struct adc_device *adc_device_p)
{
    DBG_ASSERT_CPU_INTERRUPTS_DISABLED();
    DBG_ASSERT(
        adc_device_p->ad_signature == ADC_DEVICE_SIGNATURE,
        adc_device_p->ad_signature, adc_device_p);

    uint32_t reg_value;
    lpc2478_adc_t *adc_mmio_registers_p = adc_device_p->ad_mmio_registers_p;

    FDC_ASSERT_INTERRUPT_SOURCE_IS_SET(VIC_CHANNEL_AD0);

    reg_value = read_32bit_mmio_register(&adc_mmio_registers_p->reg_AD0STAT);
                
    FDC_ASSERT(
        (reg_value & AD0STAT_ADINT_MASK) != 0 &&
        (reg_value & AD0STAT_DONE_MASK) != 0,
        reg_value, 0);

    uint32_t adc_done_mask = (reg_value & AD0STAT_DONE_MASK);

    for (uint8_t i = 0; i < NUM_ADC_CHANNELS; i ++)
    {
        if (adc_done_mask & BIT(i))
        {
            struct adc_channel *adc_channel_p = &g_adc_channels[i];

            /*
             * Read the corresponding reg_AD0DR register, to clear the
             * interrupt source:
             */
            reg_value = read_32bit_mmio_register(&adc_mmio_registers_p->reg_AD0DR[i]);

            adc_channel_p->adc_result = GET_BIT_FIELD(
                reg_value, AD0DR_V_OVER_VREF_MASK, AD0DR_V_OVER_VREF_SHIFT);

            FDC_ASSERT(
                !adc_channel_p->adc_conversion_completed,
                adc_channel_p, i);

            adc_channel_p->adc_conversion_completed = true;
        }
    }
}


/** 
 * A/D converter interrupt handler
 */
void
adc_interrupt_handler(
    _IN_ const struct adc_device *adc_device_p)
{
    DBG_ASSERT(
        adc_device_p->ad_signature == ADC_DEVICE_SIGNATURE,
        adc_device_p->ad_signature, adc_device_p);

    struct rtos_interrupt *adc_interrupt_p =
        *adc_device_p->ad_rtos_interrupt_pp;

    FDC_ASSERT_RTOS_INTERRUPT_HANDLER_PRECONDITIONS(adc_interrupt_p);
 
    /*
     * Signal condition variables of the channels for an A/D conversion
     * has completed 
     */
    for (uint8_t i = 0; i < NUM_ADC_CHANNELS; i ++)
    {
        struct adc_channel *adc_channel_p = &g_adc_channels[i];
            
        if (adc_channel_p->adc_conversion_completed)
        {
            rtos_k_condvar_signal(&adc_channel_p->adc_condvar);
        }
    }
}


void
select_input_pin_adc_channel(
    _IN_ uint8_t adc_channel)
{
    uint32_t reg_value;

    FDC_ASSERT(adc_channel < NUM_ADC_CHANNELS, adc_channel, NUM_ADC_CHANNELS);

    switch (adc_channel)
    {
    case 0:
        reg_value = read_32bit_mmio_register(
                        &g_pin_connect_block->reg_PINSEL[1]);

        reg_value |= PINSEL_MASK(PINSEL_ALT_01, 7); /* P0.23 */

        write_32bit_mmio_register(
            &g_pin_connect_block->reg_PINSEL[1], reg_value);

        break;

    case 1:
        reg_value = read_32bit_mmio_register(
                        &g_pin_connect_block->reg_PINSEL[1]);

        reg_value |= PINSEL_MASK(PINSEL_ALT_01, 8); /* P0.24 */

        write_32bit_mmio_register(
            &g_pin_connect_block->reg_PINSEL[1], reg_value);

        break;

    case 2:
        reg_value = read_32bit_mmio_register(
                        &g_pin_connect_block->reg_PINSEL[1]);

        reg_value |= PINSEL_MASK(PINSEL_ALT_01, 9); /* P0.25 */

        write_32bit_mmio_register(
            &g_pin_connect_block->reg_PINSEL[1], reg_value);

        break;

    case 3:
        reg_value = read_32bit_mmio_register(
                        &g_pin_connect_block->reg_PINSEL[1]);

        reg_value |= PINSEL_MASK(PINSEL_ALT_01, 10); /* P0.26 */

        write_32bit_mmio_register(
            &g_pin_connect_block->reg_PINSEL[1], reg_value);

        break;
	
    case 4:
        reg_value = read_32bit_mmio_register(
                        &g_pin_connect_block->reg_PINSEL[3]);

        reg_value |= PINSEL_MASK(PINSEL_ALT_11, 14); /* P1.30 */

        write_32bit_mmio_register(
            &g_pin_connect_block->reg_PINSEL[3], reg_value);

        break;

    case 5:
        reg_value = read_32bit_mmio_register(
                        &g_pin_connect_block->reg_PINSEL[3]);

        reg_value |= PINSEL_MASK(PINSEL_ALT_11, 15); /* P1.31 */

        write_32bit_mmio_register(
            &g_pin_connect_block->reg_PINSEL[3], reg_value);

        break;

    case 6:
        reg_value = read_32bit_mmio_register(
                        &g_pin_connect_block->reg_PINSEL[0]);

        reg_value |= PINSEL_MASK(PINSEL_ALT_11, 12); /* P0.12 */

        write_32bit_mmio_register(
            &g_pin_connect_block->reg_PINSEL[0], reg_value);

        break;

    case 7:
        reg_value = read_32bit_mmio_register(
                        &g_pin_connect_block->reg_PINSEL[0]);

        reg_value |= PINSEL_MASK(PINSEL_ALT_11, 13); /* P0.13 */

        write_32bit_mmio_register(
            &g_pin_connect_block->reg_PINSEL[0], reg_value);

        break;
    }
}


/*
 * Starts an A/D conversion for a given ADC channel and then it waits
 * until the A/D conversion is done.
 */
uint32_t
read_adc_channel(
    _IN_ const struct adc_device *adc_device_p,
    _IN_ uint8_t adc_channel)
{
    uint32_t reg_value;
    fdc_error_t fdc_error;
    struct adc_channel *adc_channel_p;

    FDC_ASSERT(
        adc_device_p->ad_signature == ADC_DEVICE_SIGNATURE,
        adc_device_p->ad_signature, adc_device_p);

