jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
    FDC_ASSERT(adc_channel < NUM_ADC_CHANNELS, adc_channel, NUM_ADC_CHANNELS);

    lpc2478_adc_t *adc_mmio_registers_p = adc_device_p->ad_mmio_registers_p;

    adc_channel_p = &g_adc_channels[adc_channel];
    FDC_ASSERT(
        !adc_channel_p->adc_conversion_completed,
        adc_channel_p, adc_channel);

    reg_value = read_32bit_mmio_register(
                    &adc_mmio_registers_p->reg_AD0CR);

    /*
     * Select the channel pin:
     */ 
    SET_BIT_FIELD(reg_value, AD0CR_SEL_MASK, AD0CR_SEL_SHIFT, BIT(adc_channel));
   
    /*
     * Indicate that we want to start the A/D conversion now:
     */
    
    SET_BIT_FIELD(reg_value, AD0CR_START_MASK, AD0CR_START_SHIFT, 0x1);
   
    write_reg_AD0CR(&adc_mmio_registers_p->reg_AD0CR, reg_value);

    /*
     * Wait until the conversion is complete:
     */
    cpu_status_register_t cpu_status_register = rtos_k_disable_cpu_interrupts();

    while (!adc_channel_p->adc_conversion_completed)
    {
        rtos_k_condvar_wait_interrupt(&adc_channel_p->adc_condvar);
    }

    adc_channel_p->adc_conversion_completed = false;

#if 0 // XXX Remove this code
    uint32_t adc_done_mask;
    do {
        reg_value = read_32bit_mmio_register(&adc_mmio_registers_p->reg_AD0STAT);
                
        FDC_ASSERT(
            (reg_value & AD0STAT_ADINT_MASK) != 0 &&
            (reg_value & AD0STAT_DONE_MASK) != 0,
            reg_value, 0);

        adc_done_mask = (reg_value & AD0STAT_DONE_MASK);
    } while ((adc_done_mask & BIT(adc_channel)) == 0);

    reg_value = read_32bit_mmio_register(&adc_mmio_registers_p->reg_AD0DR[adc_channel]);

    adc_channel_p->adc_result = GET_BIT_FIELD(
        reg_value, AD0DR_V_OVER_VREF_MASK, AD0DR_V_OVER_VREF_SHIFT);
#endif // XXX

    rtos_k_restore_cpu_interrupts(cpu_status_register);

    return adc_channel_p->adc_result;
}


void
init_trimpot(void)
{
    select_input_pin_adc_channel(TRIMPOT_ADC_CHANNEL);
}
    
uint32_t
read_trimpot(void)
{
    return read_adc_channel(g_adc_device_p, TRIMPOT_ADC_CHANNEL);
}


#if 0
static void
init_spi(bool master)
{
    uint32_t reg_value;

    /*
     * The SSP0 and SPI ports are mutually exclusive
     */
    FDC_ASSERT(!ssp0_connected, 0, 0);
    spi_connected = true;

    /*
     * XXX Not implemented yet
     */ 
    FDC_ASSERT(false, 0, 0);

    /*
     * Turn on SPI power in the System Control Block
     */
    turn_on_power(PCONP_PCSPI);

    uint32_t spi_pclksel_freq = get_peripheral_clock_freq(0, PCLK_SPI);
    
    if (spi_pclksel_freq == 0)
    {
        FDC_ASSERT(false, 0, 0);
        return;
    }

    /*
     * Configure pins:
     *
     * XXX Not implemented yet
     */ 
    FDC_ASSERT(false, 0, 0);
}
#endif


void
init_ssp(
    const struct ssp_controller *ssp_controller_p,
    bool master)
{
    uint32_t reg_value;

    FDC_ASSERT(
        ssp_controller_p->sc_signature == SSP_CONTROLLER_SIGNATURE,
        ssp_controller_p->sc_signature, ssp_controller_p);

    lpc2478_ssp_t *ssp_mmio_registers_p = ssp_controller_p->sc_mmio_registers_p;
    cpu_id_t cpu_id = SOC_GET_CURRENT_CPU_ID();

    if (ssp_controller_p == &g_ssp_controllers[0])
    {
        /*
         * The SSP0 and SPI ports are mutually exclusive
         */
        FDC_ASSERT(!spi_connected, 0, 0);
        ssp0_connected = true;
    }

    struct ssp_controller_var *ssp_controller_var_p =
        ssp_controller_p->sc_var_p;

    rtos_k_condvar_init(
        ssp_controller_p->sc_condvar_name_p,
        cpu_id,
        &ssp_controller_var_p->sc_condvar);

    /*
     * Configure the SCK pin:
     */
    configure_pin(&ssp_controller_p->sc_pin_sck, true);

    if (!master)
    {
        /*
         * Configure the SSEL pin as input if the LPC2478 is an SPI slave of another chip:
         */
        configure_pin(&ssp_controller_p->sc_pin_ssel, false);
    }

    /*
     * Configure the MISO pin as input pin:
     */
    configure_pin(&ssp_controller_p->sc_pin_miso, false);

    /*
     * Configure the MOSI pin as output pin:
     */
    configure_pin(&ssp_controller_p->sc_pin_mosi, true);

    /*
     * Turn on SSP power in the System Control Block
     */
    turn_on_power(ssp_controller_p->sc_pconp_mask);

    /*
     * Clear the CR1 register before configuring other SSP registers:
     * (to ensure that the SSP controller is disabled while being configured - SSE bit is 0)
     */
    reg_value = 0;
    write_8bit_mmio_register(
        &ssp_mmio_registers_p->reg_CR1, reg_value);

    /*
     * Initialize of the CR0 register:
     * - data size 8 bits
     * - frame format SPI
     * - Clock out polarity: 0 SSP controller maintains the bus clock low between frames
     * - Clock Out Phase: 0 SSP controller captures serial data on the first clock
     *   transition of the frame
     * - Serial Clock Rate: 0 (number of prescaler-output clocks per bit on the bus, minus one)
     */
    reg_value = 0;
    SET_BIT_FIELD(reg_value, SSP_CR0_DSS_MASK, SSP_CR0_DSS_SHIFT, 8 - 1);
    SET_BIT_FIELD(reg_value, SSP_CR0_FRF_MASK, SSP_CR0_FRF_SHIFT, SSP_FRF_SPI);
    write_16bit_mmio_register(
        &ssp_mmio_registers_p->reg_CR0, reg_value);

    /*
     * For now, we don't enable generation of SSP interrupts
     */
    reg_value = 0;
    write_8bit_mmio_register(
        &ssp_mmio_registers_p->reg_IMSC, reg_value);

    /*
     * For now, we don't enable DMA for the SSP controller
     */
    reg_value = 0;
    write_16bit_mmio_register(
        &ssp_mmio_registers_p->reg_DMACR, reg_value);

    /*
     * Calculate value for the SSP clock divider:
     *
     * The APB clock (PCLK) is divided by this value plus one to produce the
     * clock for SSP port, which should be less than or equal to 4 MHz.
     *
     * ssp_pclksel_freq / (ssp_clock_divider + 1) = SSP_CLOCK_FREQUENCY
     *
     * So,
     * ssp_clock_divider = (ssp_pclk_freq / SSP_CLOCK_FREQUENCY) - 1
     */

