jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
    uint32_t ssp_pclksel_freq = get_peripheral_clock_freq(
        ssp_controller_p->sc_pclksel_index,
        ssp_controller_p->sc_ssp_pclk_shift);
    
    FDC_ASSERT(ssp_pclksel_freq != 0, ssp_controller_p, 0);

    uint8_t ssp_clock_divider = (ssp_pclksel_freq / SSP_CLOCK_FREQUENCY) - 1;
  
    /*
     * Set SSP clock frequency:
     */
    write_8bit_mmio_register(
        &ssp_mmio_registers_p->reg_CPSR_CPSDVSR, ssp_clock_divider);

    /*
     * Enable SSP controller:
     */
    reg_value = read_8bit_mmio_register(
                    &ssp_mmio_registers_p->reg_CR1);

    reg_value |= SSP_CR1_SSE_MASK;

    write_8bit_mmio_register(
        &ssp_mmio_registers_p->reg_CR1, reg_value);

    ssp_flush_transmit_receive_fifos(ssp_controller_p);

    /*
     * Disable interrupts in the ARM core
     */
    cpu_status_register_t cpu_status_register = rtos_k_disable_cpu_interrupts();

    /*
     * Install ISR before enabling interrupt source:
     */
    rtos_k_register_interrupt(
        &ssp_controller_p->sc_rtos_interrupt_params,
        ssp_controller_p->sc_rtos_interrupt_pp);

    DBG_ASSERT(
        *ssp_controller_p->sc_rtos_interrupt_pp != NULL,
        ssp_controller_p->sc_rtos_interrupt_pp, ssp_controller_p);

    /*
     * Install ISR before enabling interrupt source:
     */
    rtos_k_register_interrupt(
        &ssp_controller_p->sc_rtos_interrupt_params,
        ssp_controller_p->sc_rtos_interrupt_pp);

    DBG_ASSERT(
        *ssp_controller_p->sc_rtos_interrupt_pp != NULL,
        ssp_controller_p->sc_rtos_interrupt_pp, ssp_controller_p);

    /*
     * Restore previous interrupt masking in the ARM core
     */
    rtos_k_restore_cpu_interrupts(cpu_status_register);
}


void
ssp_flush_transmit_receive_fifos(
    const struct ssp_controller *ssp_controller_p)
{
    uint32_t reg_value;
    lpc2478_ssp_t *ssp_mmio_registers_p = ssp_controller_p->sc_mmio_registers_p;

    /*
     * Flush transmit FIFO:
     */
    do {
        reg_value = read_8bit_mmio_register(
            &ssp_mmio_registers_p->reg_SR);
    } while (!(reg_value & SSP_SR_TFE_MASK));

    /*
     * Flush receive FIFO:
     */
    while (reg_value & SSP_SR_RNE_MASK)
    {
        (void)read_16bit_mmio_register(&ssp_mmio_registers_p->reg_DR_data);
        reg_value = read_8bit_mmio_register(&ssp_mmio_registers_p->reg_SR);
    }
}


/** 
 * Clear SSP controller interrupt source
 */
void
clear_ssp_controller_interrupt_source(
    _IN_ const struct ssp_controller *ssp_controller_p)
{
    DBG_ASSERT_CPU_INTERRUPTS_DISABLED();
    DBG_ASSERT(
        ssp_controller_p->sc_signature == SSP_CONTROLLER_SIGNATURE,
        ssp_controller_p->sc_signature, ssp_controller_p);

        uint32_t reg_value;
    uint8_t interrupt_source;

    FDC_ASSERT(
        ssp_controller_p->sc_signature == SSP_CONTROLLER_SIGNATURE,
        ssp_controller_p->sc_signature, ssp_controller_p);

    lpc2478_ssp_t *ssp_mmio_registers_p = ssp_controller_p->sc_mmio_registers_p;

    FDC_ASSERT_INTERRUPT_SOURCE_IS_SET(ssp_controller_p->sc_vic_channel);

    /*
     * Check reason for interrupt:
     */
    reg_value = read_8bit_mmio_register(&ssp_mmio_registers_p->reg_MIS);
    if ((reg_value & (SSP_MIS_TXMIS_MASK | SSP_MIS_RXMIS_MASK)) == 0)
    {
       (void)CAPTURE_FDC_ERROR("Unexpected SSP interrupt", reg_value, ssp_controller_p);

        /*
         * Clear unexpected interrupt source:
         */
        write_8bit_mmio_register(
            &ssp_mmio_registers_p->reg_ICR, 
            SSP_ICR_RORIC_MASK | SSP_ICR_RTIC_MASK);

       return;
    }

    if (reg_value & SSP_MIS_TXMIS_MASK)
    {
        FDC_ASSERT(
            (reg_value & SSP_MIS_RXMIS_MASK) == 0,
            reg_value, ssp_controller_p);

        interrupt_source = SSP_IMSC_TXIM_MASK;
    }
    else
    {
        FDC_ASSERT(
            (reg_value & SSP_MIS_TXMIS_MASK) == 0,
            reg_value, ssp_controller_p);

        interrupt_source = SSP_IMSC_RXIM_MASK;
    }

    reg_value = read_8bit_mmio_register(&ssp_mmio_registers_p->reg_RIS);
    FDC_ASSERT(
        (reg_value & (SSP_RIS_TXRIS_MASK | SSP_RIS_RXRIS_MASK)) != 0,
        reg_value, ssp_controller_p);

    /*
     * Since we cannot clear the interrupt source at the SSP here, we disable
     * further interrupts of this type in the SSP controller. Also, we need to
     * disable the corresponding VIC channel, so that we don't get interrupted
     * again for this interrupt that are leaving pending.
     *
     * NOTE:
     * - To clear the TXIM interrupt we need to write to the Tx fifo.
     * - To clear the RXIM interrupt we need to read from the Rx fifo.
     */

    reg_value = read_8bit_mmio_register(&ssp_mmio_registers_p->reg_IMSC);

    /*
     * Clear reserved bits. Reading reserved bits is not defined, so the
     * register value read can contain garbage 1's in these bits, and we are
     * not supposed to write 1's to reserved bits.
     */ 
    CLEAR_BIT_FIELD(reg_value, SSP_IMSC_RESERVED_MASK);

    FDC_ASSERT(
        (reg_value & (SSP_IMSC_TXIM_MASK | SSP_IMSC_RXIM_MASK)) == interrupt_source,
        reg_value, interrupt_source);

    reg_value &= ~interrupt_source;
  
    write_8bit_mmio_register(
        &ssp_mmio_registers_p->reg_IMSC, reg_value);

    /*
     * Disable VIC channel:
     */
    write_32bit_mmio_register(
        &g_vic_mmio_registers_p->reg_VICIntEnClear,
        VIC_CHANNEL_MASK(ssp_controller_p->sc_rtos_interrupt_params.irp_channel));

    struct ssp_controller_var *ssp_controller_var_p =
        ssp_controller_p->sc_var_p;

    FDC_ASSERT(
        !ssp_controller_var_p->sc_interrupt_pending,
        ssp_controller_var_p, ssp_controller_p);

    ssp_controller_var_p->sc_interrupt_pending = true;
}


/** 
 * SSP controller interrupt handler
 */
void
ssp_controller_interrupt_handler(
    _IN_ const struct ssp_controller *ssp_controller_p)
{
    uint32_t reg_value;
    uint8_t interrupt_source;

    FDC_ASSERT(
        ssp_controller_p->sc_signature == SSP_CONTROLLER_SIGNATURE,
        ssp_controller_p->sc_signature, ssp_controller_p);

