jgrivera67/McRTOS/src/BoardSupport/LPC2478-STK/lpc2478_hardware_abstractions.c
    struct rtos_interrupt *ssp_interrupt_p = 
        *ssp_controller_p->sc_rtos_interrupt_pp;

    FDC_ASSERT_RTOS_INTERRUPT_HANDLER_PRECONDITIONS(ssp_interrupt_p);

    /*
     * Signal this SSP's condvar:
     */

   struct ssp_controller_var *ssp_controller_var_p =
        ssp_controller_p->sc_var_p;

    FDC_ASSERT(
        ssp_controller_var_p->sc_interrupt_pending,
        ssp_controller_var_p, ssp_controller_p);

    rtos_k_condvar_signal(&ssp_controller_var_p->sc_condvar);
}


static inline void
ssp_wait_for_interrupt(
    const struct ssp_controller *ssp_controller_p, uint8_t ssp_interrupt_mask)
{
    uint32_t reg_value;
    lpc2478_ssp_t *ssp_mmio_registers_p = ssp_controller_p->sc_mmio_registers_p;

    FDC_ASSERT(
        ssp_controller_p->sc_signature == SSP_CONTROLLER_SIGNATURE,
        ssp_controller_p->sc_signature, ssp_controller_p);

    FDC_ASSERT(
        (ssp_interrupt_mask & (SSP_IMSC_TXIM_MASK | SSP_IMSC_RXIM_MASK)) == 
            SSP_IMSC_TXIM_MASK ||
        (ssp_interrupt_mask & (SSP_IMSC_TXIM_MASK | SSP_IMSC_RXIM_MASK)) == 
            SSP_IMSC_RXIM_MASK,
        ssp_interrupt_mask, ssp_controller_p);

#ifdef DEBUG
    reg_value = read_32bit_mmio_register(&g_vic_mmio_registers_p->reg_VICIntEnable);
    DBG_ASSERT(
        (reg_value & VIC_CHANNEL_MASK(ssp_controller_p->sc_vic_channel)) != 0,
        reg_value, ssp_controller_p);
#endif

    /*
     * Enable specified interrupt in the SSP controller:
     * - TXIM interrupt: asserted when the Tx FIFO is at least half empty and
     *   cleared upon the next write to the Tx FIFO.
     * - RXIM interrupt: asserted when the Rx FIFO is at least half full and
     *   cleared upon the next read form the Rx FIFO.
     */

    reg_value = read_8bit_mmio_register(&ssp_mmio_registers_p->reg_IMSC);

    /*
     * Clear reserved bits. Reading reserved bits is not defined, so the
     * register value read can contain garbage 1's in these bits, and we are
     * not supposed to write 1's to reserved bits.
     */ 
    CLEAR_BIT_FIELD(reg_value, SSP_IMSC_RESERVED_MASK);

    FDC_ASSERT(reg_value == 0, reg_value, 0);

    reg_value |= ssp_interrupt_mask;
  
    write_8bit_mmio_register(
        &ssp_mmio_registers_p->reg_IMSC, reg_value);

    /*
     * Re-enable VIC channel:
     */
    write_32bit_mmio_register(
        &g_vic_mmio_registers_p->reg_VICIntEnable,
        VIC_CHANNEL_MASK(ssp_controller_p->sc_rtos_interrupt_params.irp_channel));

    /*
     * Wait until interrupt is received:
     */

    struct ssp_controller_var *ssp_controller_var_p =
        ssp_controller_p->sc_var_p;

    while (!ssp_controller_var_p->sc_interrupt_pending)
    {
        rtos_k_condvar_wait_interrupt(&ssp_controller_var_p->sc_condvar);
    }

    ssp_controller_var_p->sc_interrupt_pending = false;
}


/**
 * Transmits a 16-bit value as two 8-bit transfers, with the high byte first.
 */
uint16_t
ssp_transmit_receive_16bit_value(
    const struct ssp_controller *ssp_controller_p,
    uint16_t outgoing_value)
{
    uint8_t outgoing_buffer[2];
    uint8_t incoming_buffer[2];
    uint16_t incoming_value;
   
    outgoing_buffer[0] = outgoing_value >> 8;
    outgoing_buffer[1] = outgoing_value & 0xff;

    ssp_transmit_receive_buffer(
        ssp_controller_p, outgoing_buffer, incoming_buffer, 2);
    
    incoming_value = incoming_buffer[0] << 8;
    incoming_value |= incoming_buffer[1];

    return incoming_value;
}


void
ssp_transmit_receive_buffer(
    const struct ssp_controller *ssp_controller_p,
    const uint8_t *outgoing_buffer, uint8_t *incoming_buffer, size_t size)
{
    uint8_t status_reg_value;
    uint16_t data_reg_value;
    lpc2478_ssp_t *ssp_mmio_registers_p = ssp_controller_p->sc_mmio_registers_p;

    FDC_ASSERT(
        outgoing_buffer != NULL && size != 0 &&
        outgoing_buffer + size > outgoing_buffer,
        outgoing_buffer, size);

    FDC_ASSERT(
        incoming_buffer == NULL ||
        incoming_buffer + size > incoming_buffer,
        incoming_buffer, size);

    status_reg_value = read_8bit_mmio_register(&ssp_mmio_registers_p->reg_SR);
    FDC_ASSERT(
        (status_reg_value & SSP_SR_TFE_MASK) != 0 && (status_reg_value & SSP_SR_RNE_MASK) == 0,
        status_reg_value , 0);

    const uint8_t *const out_buffer_end_p = outgoing_buffer + size;
    uint8_t *in_buffer_cursor_p = incoming_buffer; 

    for (const uint8_t *out_buffer_cursor_p = outgoing_buffer; 
         out_buffer_cursor_p != out_buffer_end_p; out_buffer_cursor_p ++)
    {
        /*
         * Transmit next byte:
         */ 

        for ( ; ; )
        {
            status_reg_value = read_8bit_mmio_register(&ssp_mmio_registers_p->reg_SR);
            if ((status_reg_value & SSP_SR_TNF_MASK) != 0)
            {
                break;
            }

            ssp_wait_for_interrupt(ssp_controller_p, SSP_IMSC_TXIM_MASK);
        }

        data_reg_value = *out_buffer_cursor_p;
        write_16bit_mmio_register(
            &ssp_mmio_registers_p->reg_DR_data, data_reg_value);

        /*
         * Receive next byte:
         */

        for ( ; ; )
        {
            status_reg_value = read_8bit_mmio_register(&ssp_mmio_registers_p->reg_SR);
            if ((status_reg_value & SSP_SR_RNE_MASK) != 0)
            {
                break;
            }
        
            //ssp_wait_for_interrupt(ssp_controller_p, SSP_IMSC_RXIM_MASK);
        }
   
        data_reg_value = read_16bit_mmio_register(&ssp_mmio_registers_p->reg_DR_data);

        FDC_ASSERT(data_reg_value <= UINT8_MAX, data_reg_value, 0);

        if (in_buffer_cursor_p != NULL)
        {
            *in_buffer_cursor_p = data_reg_value;
            in_buffer_cursor_p ++;
        }
    }
}


/**
 * Puts the processor in idle mode to wait for interrupts
 */
void
wait_for_interrupts(void)
{
    uint8_t reg_PCON = read_8bit_mmio_register(&g_scb_mmio_registers_p->reg_PCON);
   
    SET_SCB_PCON_IDLE_MODE(reg_PCON);

    write_8bit_mmio_register(&g_scb_mmio_registers_p->reg_PCON, reg_PCON);
}


/**
 * Generate function that reads from an MMIO register of the given bit width
 */
#define GEN_READ_MMIO_REGISTER_FUNCTION(_func_name, _reg_type, _value_type) \
    _value_type                                                         \
    _func_name(volatile _reg_type *io_reg_p)                            \
    {                                                                   \
        FDC_ASSERT_VALID_MMIO_ADDRESS(io_reg_p);                        \
        return *io_reg_p;                                               \
    }

/**
 * Generate function that writes to an MMIO register of the given bit width
 */
#define GEN_WRITE_MMIO_REGISTER_FUNCTION(_func_name, _reg_type, _value_type) \
    void                                                                \
    _func_name(volatile _reg_type *io_reg_p, _value_type value)         \
    {                                                                   \
        FDC_ASSERT_VALID_MMIO_ADDRESS(io_reg_p);                        \
        *io_reg_p = value;                                              \
    }   

GEN_READ_MMIO_REGISTER_FUNCTION(read_32bit_mmio_register, uint32_t, uint32_t)

GEN_WRITE_MMIO_REGISTER_FUNCTION(write_32bit_mmio_register, uint32_t, uint32_t)

GEN_READ_MMIO_REGISTER_FUNCTION(read_16bit_mmio_register, uint16_t, uint16_t)

GEN_WRITE_MMIO_REGISTER_FUNCTION(write_16bit_mmio_register, uint16_t, uint16_t)

GEN_READ_MMIO_REGISTER_FUNCTION(read_8bit_mmio_register, uint8_t, uint8_t)

GEN_WRITE_MMIO_REGISTER_FUNCTION(write_8bit_mmio_register, uint8_t, uint8_t)

